{"title": "Prospective Evaluation of a Rapid Nanoparticle-Based Lateral Flow Immunoassay (Stic Expert HIT®) for the Diagnosis of Heparin-Induced Thrombocytopenia", "abstract": "Abstract 1087 Heparin-induced thrombocytopenia (HIT) is a severe complication of heparin treatments associated with a high risk of venous and arterial thrombosis. HIT is often difficult to diagnose in clinical practice since most patients present several potential causes of thrombocytopenia. A scoring system named 4T9s and based on four criteria (i.e. Thrombocytopenia, Timing of platelet count fall, Thrombosis or other sequelae, oTher cause of thrombocytopenia) is currently used to evaluate the probability of HIT before laboratory testing. Recently, a rapid lateral flow immunoassay (LFIA) based on the use of PF4/polyanion complexes linked to biotin as antigens and of gold nanoparticles coated with antibodies specific to biotin has been developed (Stic Expert HIT ® , Stago Asnieres France). This test is IgG-specific since gold particles are immobilized on the nitrocellulose strip by anti-human IgG and become visible as a colored line when IgG antibodies to PF4/heparin complexes are present in the patient sample. The aim of our study was to evaluate the performances of this rapid assay in a large prospective cohort of patients with suspected HIT. In addition, we compared the results obtained with serum and plasma samples and evaluated the inter-reader reproducibility of the assay. Patients and methods: Two hundred and sixteen consecutive patients were enrolled from February to June 2012 in 10 French centers. The pretest probability of HIT was evaluated using the 4T9s score blind to antibody test results. The Stic Expert HIT ® was performed in each center on plasma and serum. IgG-specific ELISA (Asserachrom HPIA IgG ® ) and serotonin release assay were also performed in the coordinating center (Tours). HIT was confirmed only when both SRA and IgG specific H/PF4 ELISA were positive. Results: Definite HIT was diagnosed in 24 patients and the incidence of HIT therefore equaled 11.1% in our cohort. The risk of HIT was evaluated as low (LR), intermediate (IR) or high (HR) by the 4T9s in 27.8%, 63.2% and 9.0% of patients enrolled, respectively. The negative predictive value of (NPV) of the 4T9s was 96.6% since definite HIT was diagnosed in 2 of the 59 LR patients. Although interpretation of LFIA results is visual, the inter-reader reproducibility was excellent (Kappa test ratio higher than 0.9) whether the test was performed with plasma or serum. When performed on plasma samples, LFIA was negative in 159 patients without HIT (NPV 99.4%,) and the negative likelihood ratio (LR-) was 0.05. Results obtained with serum samples were similar with NPV and LR- values of 100% and less than 0.01, respectively. On the other hand, LFIA was positive in 54 patients, including 23 with definite HIT (positive predictive value = 42.6%), with a positive LR value of 5.87. The pre-test probability of HIT was 3.4%, 9.7%, and 36.8% in the patients classified with the 4Ts score as having low, intermediate and high risk of HIT, respectively. The post-test probability of HIT was then calculated according to the Bayes theorem and using the LR values of LFIA obtained. The probability of HIT decreased dramatically to 0.5% in IR patients when the test result was negative. Alternatively, this probability increased to 38% only when LFIA was positive. Discussion and Conclusion: One major advantage of the LFIA Stic Expert HIT ® is the possibility of obtaining a result in less than 40 minutes and a strategy based on results of both this assay and the 4Ts score can therefore be proposed for the management of patients with suspected HIT in emergency conditions. The Stic Expert HIT ® can be performed both on serum and plasma and a negative result is able to confidently rule out the diagnosis of HIT since NPV and LR- values are excellent (>99% and ® is negative. Disclosures: No relevant conflicts of interest to declare.", "year": 2012, "ssId": "0222a48657d554b2a5a3d7ec3bb0b6833b8970a1", "arXivId": null, "link": null, "openAccess": false, "authors": ["C. Pouplard", "D. Leroux", "N. Hézard", "A. Lebreton", "A. Bauters", "William W. Cohen", "E. Maistre", "I. Diaz", "M. Huisse", "C. Ternisien", "S. Voisin", "Y. Gruel"]}