{"title": "Knowledge Enhanced Multi-modal Fake News Detection", "abstract": "Recent years have witnessed the significant damage caused by various types of fake news. Although considerable effort has been applied to address this issue and much progress has been made on detecting fake news, most existing approaches mainly rely on the textual content and/or social context, while knowledge-level information—entities extracted from the news content and the relations between them—is much less explored. Within the limited work on knowledge-based fake news detection, an external knowledge graph is often required, which may introduce additional problems: it is quite common for entities and relations, especially with respect to new concepts, to be missing in existing knowledge graphs, and both entity prediction and link prediction are open research questions themselves. Therefore, in this work, we investigate knowledge-based fake news detection that does not require any external knowledge graph. Specifically, our contributions include: (1) transforming the problem of detecting fake news into a subgraph classification task—entities and relations are extracted from each news item to form a single knowledge graph, where a news item is represented by a subgraph. Then a graph neural network (GNN) model is trained to classify each subgraph/news item. (2) Further improving the performance of this model through a simple but effective multi-modal technique that combines extracted knowledge, textual content and social context. Experiments on multiple datasets with thousands of labelled news items demonstrate that our knowledge-based algorithm outperforms existing counterpart methods, and its performance can be further boosted by the multi-modal approach.", "year": 2021, "ssId": "04db62a14f78f693d6bd14a4803b9b73325b36bb", "arXivId": "2108.04418", "link": "https://arxiv.org/pdf/2108.04418.pdf", "openAccess": true, "authors": ["Yi Han", "Amila Silva", "Ling Luo", "S. Karunasekera", "C. Leckie"]}