{"title": "Relational Words Have High Metaphoric Potential Semantic Signatures for Example-based Linguistic Metaphor Detection Automatic Metaphor Detection Using Large-scale Lexical Resources and Conventional Metaphor Ex- Traction Cross-lingual Metaphor Detection Using Common Semantic Features Identifying Meta", "abstract": "ii Introduction Characteristic to all areas of human activity (from poetic to ordinary to scientific) and, thus, to all types of discourse, metaphor becomes an important problem for natural language processing. Its ubiquity in language has been established in a number of corpus studies and the role it plays in human reasoning has been confirmed in psychological experiments. This makes metaphor an important research area for computational and cognitive linguistics, and its automatic identification and interpretation indispensable for any semantics-oriented NLP application. The work on metaphor in NLP and AI started in the 1980s, providing us with a wealth of ideas on the structure and mechanisms of the phenomenon. The last decade witnessed a technological leap in natural language computation, whereby manually crafted rules gradually give way to more robust corpus-based statistical methods. This is also the case for metaphor research. In the recent years, the problem of metaphor modeling has been steadily gaining interest within the NLP community, with a growing number of approaches exploiting statistical techniques. Compared to more traditional approaches based on hand-coded knowledge, these more recent methods tend to have a wider coverage, as well as be more efficient, accurate and robust. However, even the statistical metaphor processing approaches so far often focused on a limited domain or a subset of phenomena. At the same time, recent work on computational lexical semantics and lexical acquisition techniques, as well as a wide range of NLP methods applying machine learning to open-domain semantic tasks, open many new avenues for creation of large-scale robust tools for recognition and interpretation of metaphor. This workshop is the first one focused on modelling of metaphor using NLP techniques. Recent related events include workshops on Computational Approaches to Figurative Language (NAACL 2007) and on Computational Approaches to Linguistic Creativity (NAACL 2009, NAACL 2010). We received 14 submissions and accepted 10. Each paper was carefully reviewed by at least 3 members of the Program Committee. The selected papers offer explorations into the following directions: (1) creation of metaphor-annotated datasets; (2) identification of new features that are useful for metaphor identification; (3) cross-lingual metaphor identification. The papers represent a variety of approaches to utilization and creation of datasets. While existing annotated corpora were used in some papers (Dunn, Tsvetkov et al), most papers describe creation of new annotated materials. Along with annotation guidelines adapted from the MIP and MIPVU procedures (Badryzlova et al), more intuitive …", "year": 2013, "ssId": "0a227a21172f7344ad911aeefc40ae4ec82d7cac", "arXivId": null, "link": null, "openAccess": false, "authors": ["Ekaterina Shutova", "S. Argamon", "J. Barnden", "Gemma Boleda", "Ted Briscoe", "S. Clark", "Anna Feldman", "J. Feldman", "Michael Flor", "Eugenie Giesbrecht", "Valia Kordoni", "A. Korhonen", "Mark G. Lee", "Patricia Lichtenstein", "James H. Martin", "A. Musolff", "S. Narayanan", "T. Poibeau", "T. Veale", "Andreas Vlachos", "Anja Jamrozik", "Eyal Sagi", "Micah B. Goldwater", "Michael Mohler", "D. Bracewell", "Marc T. Tomlinson", "David R Hinote", "Y. Wilks", "Adam Dalton", "James F. Allen", "Lucian", "Dirk Hovy", "Shashank Shrivastava", "Sujay Kumar Jauhar", "Mrinmaya Sachan", "Kartik Goyal", "Huying Li", "Whitney E. Sanders", "Eduard", "Ilana Heintz", "Ryan Gabbard", "M. Srivastava", "D. Barner", "Donald Black", "Majorie Friedman", "T. Strzalkowski", "G. Broadwell", "Sarah M. Taylor", "L. Feldman", "Samira Shaikh", "Ting Liu", "B. Yamrom", "Kit Cho", "Umit Boz", "Ignacio Cases", "Kyle Elliot", "Yulia Badryzlova", "N. Shekhtman", "Yekaterina Isaeva", "R. Kerimov", "Vii", "Beata Beigman Klebanov", "D. Gentner", "Lucian Galescu", "Yulia Tsvetkov", "E. Mukomel", "A. Gershman", "E. Hovy", "Marissa Friedman", "R. Weischedel", "Jonathan Dunn"]}