{"title": "Consumer Heterogeneity Modeling by Hierarchical Gaussian Process", "abstract": "Consumer’s behaviors vary a lot across individuals: for instance, people tend to have different price sensitivities to the same good and tend respond differently to promotions. It is called consumer heterogeneity in the field of marketing and plays a central role in many marketing activities. For example, pricing and product design decisions are based on an understanding of the differences among consumers in price sensitivity and valuation of product attributes(Allenby & Rossi, 1998; Montgomery, 1997). Therefore, to appropriately model the consumer heterogeneity is of great importance. However, understanding the relationship between consumer behaviors and marketing variables is challenging: first of all, the individual-level data are sparse thus to model each consumer’s behavior separately tends to overfit. Although nowadays we can collect and keep large collections of consumer behaviors’ data, the relevant data associated with a specific study are limited. Secondly, the form of the relationship itself can be complicated. For example, even we know that demand decreases as price increases, the exact form of this relationship can be involved. The effect of price in demand might be weak unless the price increases to a certain threshold. Such complicated interactions would pose a challenge of specifying the form of the model. To deal with these two challenges, we propose a hierarchical Gaussian process method. Although consumer behaviors vary a lot, people have similar demographic features such as gender, and income may share some similarities in their purchasing behaviors. Utilizing the hierarchical structure would allow to share information across different individuals. To address the second problem, we introduce the Gaussian process. It defines prior distributions for flexible models in which the regression or class probability functions are not limited to simple parametric forms. Such flexibility would enable us to capture the relationship between consumer behaviors and marketing variables automatically. In this paper, we will demonstrate the effectiveness of the proposed Hierarchical Gaussian Process approach on store-level scanner data for the refrigerated orange juice category from a Chicago Super Market", "year": 2018, "ssId": "0d3baef146655c5727452ccc0dd680d21d92ae4e", "arXivId": null, "link": null, "openAccess": false, "authors": ["Xiaoting Sun", "A. Montgomery", "Zachary Chase Lipton"]}