{"title": "Driving Confidence in a Connected Vehicle Environment: A Case Study of Expressway Work Zone", "abstract": "At present, how the application of connected vehicle technology will affect drivers’ driving psychology needs to be explored. As an important part of driving psychology, driving confidence can guide drivers to operate calmly when facing a complex traffic environment, which has an important impact on reducing accident rates and improving traffic efficiency. Based on the driving behavior data in the expressway work zone under a connected vehicle environment, this study mainly analyzed the difference between the psychological characteristics of drivers with warning information or without warning information when facing the work zone ahead. Firstly, based on driving simulation technology, the expressway work zone scene in a connected vehicle environment was designed, and the on-board human-machine interface was used to provide warning information of the work zone ahead. Secondly, the difference of drivers’ driving confidence in psychology when driving with or without warning information was analyzed by using the characteristics of average vehicle spatiotemporal diagram and gas pedal angle. Finally, a method of quantifying driving confidence was proposed, which used a kind of objective weighting method to get the weights between different indicators. Based on this method, drivers’ degree of driving confidence under two conditions was calculated. The results showed that connected vehicle technology could affect drivers’ driving confidence in psychology when facing the work zone ahead. In the connected vehicle environment, 82.9% of drivers’ degree of driving confidence would increase, and the average degree of driving confidence with warning information was 10.9% higher than that without warning information.", "year": 2020, "ssId": "11154216ca898590e7b2f0339587e3378c2c646c", "arXivId": null, "link": null, "openAccess": false, "authors": ["Guoqiang Zhao", "Liang Xu", "Yue Yu", "Haijian Li", "Xiaohua Zhao"]}