{"title": "The Effect and Underlying Mechanism of Statins in the Prevention of Post-Contrast Acute Kidney Injury: A Multicenter Retrospective Observational Study", "abstract": "\n Background: Post-Contrast acute kidney injury (PC-AKI) is a severe complication of coronary angiography (CAG) and percutaneous coronary intervention (PCI). At present, the mechanism and effect of statins on PC-AKI and its mechanism are still unclear. Methods: It was a multicenter retrospective obeservational study. We reviewed 4386 patients who underwent CAG or PCI, with serum creatinine recorded pre- or post-procedure within 72hrs after PCI, from December, 2006 to December, 2019 admitted to Sir Run Run Shaw Hospital and its medical consortium hospitals. Multivariate logical regression was used to explore whether preoperative use of statins was a protective factor for PC-AKI, and then path analysis model was used to explore the specific mechanism of statins. Results: In total, 4386 patients were enrolled in the study, the mean age was 67 yrs old, 17.9% with PC-AKI, 83.3% with pre-operative statin therapy. The incidence of PC-AKI was significantly lower in statin therapy group than non-statins therapy group. Multivariate regression indicated that pre-operative statin therapy was significantly negatively associated with percentage of elevated creatinine (β: -0.118, p<0.001) and PC-AKI (OR: 0.575, p<0.001). In pre-operative statin therapy group, no statistically significant deference was detected between atorvastatin and rosuvastatin group (OR: 1.052, p=0.558). Pathway model analysis indicated the direct protective effectiveness of pre-operative statin therapy on PC-AKI (p<0.001), but neither with its lipid-lowering effect (p=0.277) nor anti-inflammatory effect (p=0.596). Furthermore, It was found that “LDL-C→CRP” mediated the relationship between pre-operative statin therapy and PC-AKI (p=0.007); however, only explained less than 1% of the pre-operative statin therapy’s protective effects on PC-AKI. Conclusion: Pre-operative statin therapy is an independent protective factor of PC-AKI, which is not affected by the type of statins and not achieved by lipid-lowering effect or anti-inflammatory effect. Keywords : post-contrast acute kidney injury, statins, path analysis, mediation analysis.", "year": 2021, "ssId": "115f1366318e7622f89f3a870e5863282670b1ad", "arXivId": null, "link": null, "openAccess": false, "authors": ["Maoning Lin", "Tian Xu", "Wenjuan Zhang", "Duanbin Li", "Ya Li", "Xu-Lin Hong", "Yi Luan", "Wenbin Zhang", "Min Wang"]}