{"title": "SIGMORPHON 2021 Shared Task on Morphological Reinflection: Generalization Across Languages", "abstract": "This year’s iteration of the SIGMORPHON Shared Task on morphological reinflection focuses on typological diversity and crosslingual variation of morphosyntactic features. In terms of the task, we enrich UniMorph with new data for 32 languages from 13 language families, with most of them being under-resourced: Kunwinjku, Classical Syriac, Arabic (Modern Standard, Egyptian, Gulf), Hebrew, Amharic, Aymara, Magahi, Braj, Kurdish (Central, Northern, Southern), Polish, Karelian, Livvi, Ludic, Veps, Võro, Evenki, Xibe, Tuvan, Sakha, Turkish, Indonesian, Kodi, Seneca, Asháninka, Yanesha, Chukchi, Itelmen, Eibela. We evaluate six ∗The authors contributed equally systems on the new data and conduct an extensive error analysis of the systems’ predictions. Transformer-based models generally demonstrate superior performance on the majority of languages, achieving >90% accuracy on 65% of them. The languages on which systems yielded low accuracy are mainly underresourced, with a limited amount of data. Most errors made by the systems are due to allomorphy, honorificity, and form variation. In addition, we observe that systems especially struggle to inflect multiword lemmas. The systems also produce misspelled forms or end up in repetitive loops (e.g., RNN-based models). Finally, we report a large drop in systems’ performance on previously unseen lemmas.1 The data, systems, and their predictions are available: https://github.com/sigmorphon/2021Task0", "year": 2021, "ssId": "136235d2a3dc4f1c995eaf977aec9c42114da850", "arXivId": null, "link": null, "openAccess": false, "authors": ["Tiago Pimentel", "Maria Ryskina", "Sabrina J. Mielke", "Shijie Wu", "Eleanor Chodroff", "Brian Leonard", "Garrett Nicolai", "Yustinus Ghanggo Ate", "Salam Khalifa", "Charbel El-Khaissi", "Omer Goldman", "M. Gasser", "William Arbuthnot Sir Lane", "M. Coler", "Arturo Oncevay", "Jaime Rafael Montoya Samame", "Gema Celeste Silva Villegas", "Adam Ek", "Jean-Philippe Bernardy", "A. Shcherbakov", "Karina Sheifer", "Sofya Ganieva", "Matvey Plugaryov", "E. Klyachko", "A. Salehi", "A. A. Krizhanovsky", "Natalia Krizhanovsky", "Clara Vania", "Sardana Ivanova", "A. Salchak", "Christopher A. Straughn", "Zoey Liu", "J. North", "Duygu Ataman", "Witold Kieraś", "Marcin Woliński", "T. Suhardijanto", "Niklas Stoehr", "Z. Nuriah", "Shyam Ratan", "Francis M. Tyers", "E. M. Ponti", "Grant Aiton", "R. Hatcher", "Ritesh Kumar", "Mans Hulden", "B. Barta", "Dorina Lakatos", "Gábor Szolnok", "Judit Ács", "Mohith S Raj", "David Yarowsky", "Ryan Cotterell", "B. Ambridge", "Ekaterina Vylomova"]}