{"title": "ACM SIGAI activity report", "abstract": "We are happy to present the annual activity report of the ACM Special Interest Group on AI (ACM SIGAI), covering the period from July 2018 to June 2019.\n The scope of ACM SIGAI consists of the study of intelligence and its realization in computer systems (see also its web-site at sigai.acm.org). This includes areas such as\n autonomous agents, cognitive modeling, computer vision, constraint programming, human language technologies, intelligent user interfaces, knowledge discovery, knowledge representation and reasoning, machine learning, planning and search, problem solving and robotics.\n Members come from academia, industry and government agencies worldwide. ACM SIGAI recently added two new ACM SIGAI chapters, namely one professional chapter in Laguna Nigel (USA) and one student chapter at the SRM Institute of Science & Technology in Chennai.\n ACM SIGAI also added two new officers this year to be able to serve its membership better, namely Iolanda Leite from the Royal Institute of Technology (Sweden) as second newsletter editor-in-chief and Marion Neumann from Washington University in St. Louis (USA) as diversity officer, thus increasing diversity in the ACM SIGAI leadership committee by increasing both the number of international officers and the number of female officers and also furthering the internationalization of the ACM SIGAI newsletter. Marion will be covering diversity also as part of the ACM SIGAI newsletter. ACM SIGAI started officers meetings at major AI conferences already in 2018 and continued the new practice in 2019 (so far at the AAAI Conference), in addition to all-officers teleconferences and a monthly ACM SIGAI leadership teleconference.", "year": 2019, "ssId": "2226f5a13e3e9faac2e228e95175d3e612b52395", "arXivId": null, "link": null, "openAccess": false, "authors": ["Sven Koenig", "Sanmay Das", "Rosemary D. Paradis", "John P. Dickerson", "Yolanda Gil", "Katherine Guo", "B. Kuipers", "Iolanda Leite", "Hang Ma", "Nicholas Mattei", "A. McGovern", "L. Medsker", "T. Neller", "Marion Neumann", "P. Petrov", "Michael Rovatsos", "David G. Stork"]}