{"title": "Impact of cost-optimized dedicated hybrid transmission (DHT) constraints on powertrain optimal control", "abstract": "In the transition from internal combustion engines (ICE) based vehicles to pure battery electric vehicles (BEVs), the powertrain is becoming increasingly electrified (xEV). Based on their capability to recuperate brake energy in the legislative test cycles, intermediate xEV vehicles are classified as mild and strong electrified vehicles. Growing xEV sales currently pave the way for the application of cost-optimized dedicated components. The B segment vehicle analyzed in this work is currently equipped with a conventional coaxial transmission, which can offer multiple power sources (combustion engine, electric machine, or hybrid) in a single shift with an additional clutch. A cost-optimized dedicated hybrid transmission (DHT) is designed by eliminating the launch clutch, synchronizers, and redundant energy travel paths to replace the coaxial transmission. The DHT requires one shift for each energy path to connect the power source to the wheels. The flexible coaxial transmission requires only a low specific number of gear shifts to drive a typical test cycle. However, the DHT has constrained energy paths, leading to a high specific number of gear shifts to drive identical test cycles when applied with the standard Adaptive Equivalent Consumption Minimization Strategy (A-ECMS) optimal control. A one dimensional closed-loop simulation model for the passenger car longitudinal dynamics is used in this analysis. The vehicle velocity and evaluation criteria for the simulation are based on the Worldwide harmonized Light vehicles Test Procedure (WLTP). The loss maps from steady-state test bench measurements for the internal combustion engine (ICE), the electric motor (EM), and the transmission unit are used as inputs in building the simulation model. A drivability penalty approach is introduced in the standard A-ECMS optimal control to reduce the number of gear shifts. The work analyzes the gear shift behavior and the absolute CO2 emission between the cost-optimized DHT and the existing coaxial transmission for the considered vehicle application. Detailed power flow using a Sankey diagram from different onboard vehicle sources for the cost-optimized DHT solution is included in the results section. The developed model is validated with a prototype vehicle environment on the Urban Dynamometer Driving Schedule (UDDS).", "year": 2021, "ssId": "22f4eb19be4031e63194bbd7c355914533004918", "arXivId": null, "link": null, "openAccess": false, "authors": ["R. S. Rajan", "Yue Yu", "F. Richert"]}