{"title": "Anaphora Resolution for Transforming Regular Expressions into Honorifics in Japanese", "abstract": "The Japanese language places a heavy emphasis in establishing hierarchical relations among people, or paying respects to elders or those of higher social rank. The Japanese language includes the normal speech (常語) and honorific speech (敬 語), with honorific speech playing an important role in establishing these relationships. The honorifics in Japanese include different levels of respectful (尊敬語), humble (謙譲 語), and polite (丁寧語) speech, which are frequently used in various social or business situations. Because of this, one verb in Japanese will have at least four ways to express the same meaning in different situations. For example, word 行 く (go), it will have the four expressions as in Table 1. The mechanism of honorifics in Japanese is complicated, and many non-native Japanese speakers, as well as members of the young generations in Japan, have trouble mastering it. This situation has encouraged the study of automatic systems that identify the proper form of honorifics in Japanese including automatic translating of learners text into correct honorifics [1, 2]. However these previous works do not have a mechanism to determine which kind of honorific form should be applied in sentences without subjects. As subject omission is a common phenomenon in Japanese, this limits the practical utility of these methods. In this paper, we propose the use of anaphora resolution for this task. We incorporate anaphora resolution into a rulebased machine translation system to translate regular expressions into appropriate honorific of Japanese, and examine the effectiveness of using correct subjects annotated by a human, and those automatically predicted by anaphora resolution.", "year": 2014, "ssId": "2526c510610c7220ecc56e6b08d09c4cbaf58c3c", "arXivId": null, "link": null, "openAccess": false, "authors": ["Miao Yu", "Graham Neubig", "S. Sakti", "T. Toda", "Satoshi Nakamura"]}