{"title": "Interfacing Finite Elements with Deep Neural Operators for Fast Multiscale Modeling of Mechanics Problems", "abstract": "Multiscale modeling is an effective approach for investigating multiphysics systems with largely disparate size features, where models with different resolutions or heterogeneous descriptions are coupled together for predicting the system’s response. The solver with lower fidelity (coarse) is responsible for simulating domains with homogeneous features, whereas the expensive high-fidelity (fine) model describes microscopic features with refined discretization, often making the overall cost prohibitively high, especially for timedependent problems. In this work, we explore the idea of multiscale modeling with machine learning and employ DeepONet, a neural operator, as an efficient surrogate of the expensive solver. DeepONet is trained offline using data acquired from the fine solver for learning the underlying and possibly unknown finescale dynamics. It is then coupled with standard PDE solvers for predicting the multiscale systems with new boundary/initial conditions in the coupling stage. The proposed framework significantly reduces the computational cost of multiscale simulations since the DeepONet inference cost is negligible, facilitating readily the incorporation of a plurality of interface conditions and coupling schemes. We present various benchmarks to assess accuracy and speedup, and in particular we develop a coupling algorithm for a timedependent problem, and we also demonstrate coupling of a continuum model (finite element methods, FEM) with a neural operator representation of a particle system (Smoothed Particle Hydrodynamics, SPH) for a uniaxial tension problem with hyperelastic material. What makes this approach unique is that a well-trained over-parametrized DeepONet can generalize well and make predictions at a negligible cost. keywords: Machine Learning, Neural Operator, DeepONet, Concurrent Multiscale Coupling, Finite Element Model, Domain Decomposition ∗Corresponding author: george karniadakis@brown.edu Preprint submitted to Elsevier March 2, 2022 ar X iv :2 20 3. 00 00 3v 1 [ cs .C E ] 2 5 Fe b 20 22", "year": 2022, "ssId": "27df24c537b2d3c2a769d917adf92a6a059c5917", "arXivId": "2203.00003", "link": "https://arxiv.org/pdf/2203.00003.pdf", "openAccess": true, "authors": ["Minglang Yin", "Enrui Zhang", "Yue Yu", "G. Karniadakis"]}