{"title": "Functional Broadcast Repair of Multiple Partial Failures in Wireless Distributed Storage Systems", "abstract": "We consider a distributed storage system with <inline-formula> <tex-math notation=\"LaTeX\">$n$ </tex-math></inline-formula> nodes, where a user can recover the stored file from any <inline-formula> <tex-math notation=\"LaTeX\">$k$ </tex-math></inline-formula> nodes, and study the problem of repairing <inline-formula> <tex-math notation=\"LaTeX\">$r$ </tex-math></inline-formula> partially failed nodes. We consider <italic>broadcast repair</italic>, that is, <inline-formula> <tex-math notation=\"LaTeX\">$d$ </tex-math></inline-formula> surviving nodes transmit broadcast messages on an error-free wireless channel to the <inline-formula> <tex-math notation=\"LaTeX\">$r$ </tex-math></inline-formula> nodes being repaired, which are then used, together with the surviving data in the local memories of the failed nodes, to recover the lost content. First, we derive the trade-off between the storage capacity and the repair bandwidth for partial repair of multiple failed nodes, based on the cut-set bound for information flow graphs. It is shown that utilizing the broadcast nature of the wireless medium and the surviving contents at the partially failed nodes reduces the repair bandwidth per node significantly. Then, we list a set of invariant conditions that are sufficient for a functional repair code to be feasible. We further propose a scheme for functional repair of multiple failed nodes that satisfies the invariant conditions with high probability, and its extension to the repair of partial failures. The performance of the proposed scheme meets the cut-set bound on all the points on the trade-off curve for all admissible parameters when <inline-formula> <tex-math notation=\"LaTeX\">$k$ </tex-math></inline-formula> is divisible by <inline-formula> <tex-math notation=\"LaTeX\">$r$ </tex-math></inline-formula>, while employing linear subpacketization, which is an important practical consideration in the design of distributed storage codes. Unlike random linear codes, which are conventionally used for functional repair of failed nodes, the proposed repair scheme has lower overhead, lower input-output cost, and lower computational complexity during repair.", "year": 2021, "ssId": "2875d6cac905c3dfec4c8a8e1d89a2a7e4d71d40", "arXivId": "2111.07884", "link": "https://arxiv.org/pdf/2111.07884.pdf", "openAccess": true, "authors": ["N. Mital", "Katina Kralevska", "Congli Ling", "Deniz Gündüz"]}