{"title": "Interpretability Logic", "abstract": "This is an overview a study of interpretability logic in Zagreb for the last twenty years: a brief history and some planes for further research. The idea of treating a provability predicate as a modal operator goes back to Gödel. The same idea was taken up later by Kripke and Montague, but only in the mid–seventies was the correct choice of axioms, based on Löb’s theorem, seriously considered by several logicians independently: G. Boolos, D. de Jongh, R. Magari, G. Sambin and R. Solovay. The system GL (Gödel, Löb) is a modal propositional logic. R. Solovay 1976. proved arithmetical completeness of modal system GL. Many theories have the same provability logic GL. It means that the provability logic GL cannot distinguish some properties, as e.g. finite axiomatizability, reflexivity, etc. Some logicians considered modal representations of other arithmetical properties, for example interpretability, Πn-conservativity, interpolability ... Roughly, a theory S interprets a theory T if there is a natural way of translating the language of S into the language of T in such a way that the translations of all the axioms of T become provable in S. We write S ≥ T if this is the case. A derived notion is that of relative interpretability over a base theory T. Let A and B be arithmetical sentences. We say that A interprets B over T if T +A ≥ T +B. Modal logics for relative interpretability were first studied by P. Hájek (1981) and V. Švejdar (1983). A. Visser (1990) introduced the binary modal logic IL (interpretability logic). The interpretability logic IL results from the provability logic GL, by adding the binary modal operator ◃. The language of the interpretability logic contains propositional letters p0, p1, . . . , the logical connectives ∧, ∨,→ and ¬, and the unary modal operator and the binary modal operator ◃. The axioms of the interpretability logic IL are: all tautologies of the propositional calculus, (A → B) → ( A → B), A → A, ( A → A) → A, (A → B) → (A ◃ B), (A ◃ B ∧ B ◃ C) → (A ◃ C), ((A◃C)∧(B◃C)) → ((A∨B)◃C), (A◃B) → (♢A → ♢B), and ♢A◃A, where ♢ stands for ¬ ¬ and ◃ has the same priority as → . The deduction rules of IL are modus ponens and necessitation. Arithmetical semantics of interpretability logic is based on the fact that each sufficiently strong theory S has arithmetical formulas Pr(x) and Int(x, y). Formula Pr(x) expressing that ”x is provable in S” (i.e. formula with Gödel number x is provable in S). Formula Int(x, y) expressing that ”S + x interprets S + y.” An arithmetical interpretation is a function ∗ from modal formulas into arithmetical sentences preserving Boolean connectives and satisfying ( A)∗ = Pr(⌈A∗⌉) and (A ◃ B)∗ = Int(⌈A∗⌉, ⌈B∗⌉) (⌈A∗⌉ denote Gödel number of formula A∗). The system IL is natural from the modal point of view, but arithmetically incomplete. Various extensions of ILare obtained by adding some new axioms. These new axioms are called the principles of interpretability. We denote by ILX the system obtained by adding a principle X to the system IL. System ILM is the interpretability logic of", "year": 1990, "ssId": "35750f1908f405bb38b0708972f33fe07b378b64", "arXivId": null, "link": "https://link.springer.com/chapter/10.1007/978-1-4613-0609-2_13", "openAccess": false, "authors": ["A. Visser"]}