{"title": "Using word embeddings to improve the privacy of clinical notes", "abstract": "Abstract Objective In this work, we introduce a privacy technique for anonymizing clinical notes that guarantees all private health information is secured (including sensitive data, such as family history, that are not adequately covered by current techniques). Materials and Methods We employ a new “random replacement” paradigm (replacing each token in clinical notes with neighboring word vectors from the embedding space) to achieve 100% recall on the removal of sensitive information, unachievable with current “search-and-secure” paradigms. We demonstrate the utility of this paradigm on multiple corpora in a diverse set of classification tasks. Results We empirically evaluate the effect of our anonymization technique both on upstream and downstream natural language processing tasks to show that our perturbations, while increasing security (ie, achieving 100% recall on any dataset), do not greatly impact the results of end-to-end machine learning approaches. Discussion As long as current approaches utilize precision and recall to evaluate deidentification algorithms, there will remain a risk of overlooking sensitive information. Inspired by differential privacy, we sought to make it statistically infeasible to recreate the original data, although at the cost of readability. We hope that the work will serve as a catalyst to further research into alternative deidentification methods that can address current weaknesses. Conclusion Our proposed technique can secure clinical texts at a low cost and extremely high recall with a readability trade-off while remaining useful for natural language processing classification tasks. We hope that our work can be used by risk-averse data holders to release clinical texts to researchers.", "year": 2020, "ssId": "3a95fab610d5ff49fbdb7a4d8760b02c51df0013", "arXivId": null, "link": "https://pdfs.semanticscholar.org/7353/56da800032535598483ebb2a86655c392dfa.pdf?_ga=2.208052241.288669922.1651129063-687820255.1651129063", "openAccess": true, "authors": ["Mohamed Abdalla", "Moustafa Abdalla", "F. Rudzicz", "Graeme Hirst"]}