{"title": "Preventing undesirable behavior of intelligent machines", "abstract": "Making well-behaved algorithms Machine learning algorithms are being used in an ever-increasing number of applications, and many of these applications affect quality of life. Yet such algorithms often exhibit undesirable behavior, from various types of bias to causing financial loss or delaying medical diagnoses. In standard machine learning approaches, the burden of avoiding this harmful behavior is placed on the user of the algorithm, who most often is not a computer scientist. Thomas et al. introduce a general framework for algorithm design in which this burden is shifted from the user to the designer of the algorithm. The researchers illustrate the benefits of their approach using examples in gender fairness and diabetes management. Science, this issue p. 999 A machine learning algorithm design framework shifts the burden of avoiding undesirable behavior from user to designer. Intelligent machines using machine learning algorithms are ubiquitous, ranging from simple data analysis and pattern recognition tools to complex systems that achieve superhuman performance on various tasks. Ensuring that they do not exhibit undesirable behavior—that they do not, for example, cause harm to humans—is therefore a pressing problem. We propose a general and flexible framework for designing machine learning algorithms. This framework simplifies the problem of specifying and regulating undesirable behavior. To show the viability of this framework, we used it to create machine learning algorithms that precluded the dangerous behavior caused by standard machine learning algorithms in our experiments. Our framework for designing machine learning algorithms simplifies the safe and responsible application of machine learning.", "year": 2019, "ssId": "3abcd0ffc54c3a16c9dc5e5d3ea59eaa43070127", "arXivId": null, "link": "https://people.cs.umass.edu/~brun/pubs/pubs/Thomas19science.pdf", "openAccess": true, "authors": ["P. Thomas", "Bruno Castro da Silva", "A. Barto", "S. Giguere", "Yuriy Brun", "Emma Brunskill"]}