{"title": "Association of the classification and severity of heart failure with the incidence of contrast-induced acute kidney injury", "abstract": "Congestive heart failure (HF) is a known risk factor of contrast-induced acute kidney injury (CI-AKI). However, the relationship of the classification and severity of HF with CI-AKI remains under-explored. From January 2009 to April 2019, we recruited patients undergoing elective PCI who had complete pre- and post-operative creatinine data. According to the levels of ejection fraction (EF), HF was classified as HF with reduced EF (HFrEF) [EF < 40%], HF with mid-range EF (HFmrEF) [EF 40–49%] and HF with preserved EF (HFpEF) [EF ≥ 50%]. CI-AKI was defined as an increase of either 25% or 0.5 mg/dL (44.2 μmoI/L) in serum baseline creatinine level within 72 h following the administration of the contrast agent. A total of 3848 patients were included in the study; mean age 67 years old, 33.9% females, 48.1% with HF, and 16.9% with CI-AKI. In multivariate logistic regression analysis, HF was an independent risk factor for CI-AKI (OR 1.316, p value < 0.05). Among patients with HF, decreased levels of EF (OR 0.985, p value < 0.05) and elevated levels of N-terminal pro b-type natriuretic peptide (NT-proBNP) (OR 1.168, p value < 0.05) were risk factors for CI-AKI. These results were consistent in subgroup analysis. Patients with HFrEF were more likely to develop CI-AKI than those with HFmrEF or HFpEF (OR 0.852, p value = 0.031). Additionally, lower levels of EF were risk factors for CI-AKI in the HFrEF and HFmrEF groups, but not in the HFpEF group. NT-proBNP was an independent risk factor for CI-AKI in the HFrEF, HFmrEF and HFpEF groups. Elevated levels of NT-proBNP are independent risk factors for CI-AKI irrespective of the classification of HF. Lower levels of EF were risk factors for CI-AKI in the HFrEF and HFmrEF groups, but not in the HFpEF group.", "year": 2021, "ssId": "44268b5a208e8f48a5883bb12e3e80a13101e752", "arXivId": null, "link": null, "openAccess": false, "authors": ["Tian Xu", "Maoning Lin", "Xiaohua Shen", "Min Wang", "Wenjuan Zhang", "Liding Zhao", "Duanbin Li", "Yi Luan", "Wenbin Zhang"]}