{"title": "Deep Learning on MRI Affirms the Prominence of the Hippocampal Formation in Alzheimer’s Disease Classification", "abstract": "Deep learning techniques on MRI scans have demonstrated great potential to improve the diagnosis of neurological diseases. Here, we investigate the application of 3D deep convolutional neural networks (CNNs) for classifying Alzheimer’s disease (AD) based on structural MRI data. In particular, we take on two challenges that are under-explored in the literature on deep learning for neuroimaging. First deep neural networks typically require large-scale data that is not always available in medical studies. Therefore, we explore the use of including longitudinal scans in classification studies, greatly increasing the amount of data for training and improving the generalization performance of our classifiers. Moreover, previous studies applying deep learning to classifying Alzheimer’s disease from neuroimaging have typically addressed classification based on whole brain volumes but stopped short of performing in-depth regional analyses to localize the most predictive areas. Additionally, we show a deep net trained to distinguish between AD and cognitively normal subjects can be applied to classify mild cognitive impairment patients, with classification scores aligning empirically with the likelihood of progression to AD. Our initial results demonstrate both that we can classify AD with an area under the receiver operator characteristic curve (AUROC) of .990 and that we can predict conversion to AD among patients in the MCI subgroup with an AURUC of 0.787. We then localize the predictive regions, by performing both saliency-based interpretation and rigorous slice and lobar level ablation studies. Interestingly, our regional analyses identified the hippocampal formation, including the entorhinal cortex, to be the most predictive region for our models. This finding adds evidence that the hippocampal formation is an anatomical seat of AD and a prominent feature in its diagnosis. Together, the results of this study further demonstrate the potential of deep learning to impact AD classification and to identify AD’s structural neuroimaging signatures. The proposed classification and regional analyses methods constitute a general framework that can easily be applied to other disorders and imaging modalities. Acronyms MRI magnetic resonance imaging AD Alzheimer’s disease CN cognitively normal MCI mild cognitive impairment MCIs mild cognitive impairment stable MCIp mild cognitive impairment progression HP hippocampal formation ADNI Alzheimer’s Disease Neuroimaging Initiative HCP Human Connectome Project CNNs convolutional neural networks CAM class activation mapping ReLU rectified linear unit BN batch normalization AUC area under the curve ROC receiver operating characteristic AUROC area under the receiver operating characteristic curve", "year": 2018, "ssId": "46bf4bece58764d22764acfd3d232b50fb7767f9", "arXivId": null, "link": null, "openAccess": false, "authors": ["Xinyang Feng", "Jie Yang", "Zachary Chase Lipton", "S. Small", "F. Provenzano", "Alzheimer's Disease Neuroimaging Initiative"]}