{"title": "Hypergraph Spectral Clustering in the Weighted Stochastic Block Model", "abstract": "Spectral clustering is a celebrated algorithm that partitions the objects based on pairwise similarity information. While this approach has been successfully applied to a variety of domains, it comes with limitations. The reason is that there are many other applications in which only <italic>multi</italic>way similarity measures are available. This motivates us to explore the multiway measurement setting. In this paper, we develop two algorithms intended for such setting: hypergraph spectral clustering (HSC) and hypergraph spectral clustering with local refinement (HSCLR). Our main contribution lies in performance analysis of the polytime algorithms under a random hypergraph model, which we name the weighted stochastic block model, in which objects and multiway measures are modeled as nodes and weights of hyperedges, respectively. Denoting by <inline-formula><tex-math notation=\"LaTeX\">$n$</tex-math></inline-formula> the number of nodes, our analysis reveals the following: 1) HSC outputs a partition which is better than a random guess if the sum of edge weights (to be explained later) is <inline-formula><tex-math notation=\"LaTeX\">$\\Omega (n)$</tex-math> </inline-formula>; 2) HSC outputs a partition which coincides with the hidden partition except for a vanishing fraction of nodes if the sum of edge weights is <inline-formula><tex-math notation=\"LaTeX\">$\\omega (n)$</tex-math> </inline-formula>; and 3) HSCLR exactly recovers the hidden partition if the sum of edge weights is on the order of <inline-formula><tex-math notation=\"LaTeX\">$n \\log n$</tex-math></inline-formula>. Our results improve upon the state of the arts recently established under the model and they first settle the orderwise optimal results for the binary edge weight case. Moreover, we show that our results lead to efficient sketching algorithms for subspace clustering, a computer vision application. Finally, we show that HSCLR achieves the information-theoretic limits for a special yet practically relevant model, thereby showing no computational barrier for the case.", "year": 2018, "ssId": "47234fca1b14666d72bc5df0e2d911ff7cdea688", "arXivId": "1805.08956", "link": "https://arxiv.org/pdf/1805.08956.pdf", "openAccess": true, "authors": ["Kwangjun Ahn", "Kangwook Lee", "Changho Suh"]}