{"title": "Efficient Complex Skill Acquisition Through Representation Learning", "abstract": "One of the fundamental goals of artificial intelligence is to understand and develop intelligent agents that simulate human-level intelligence. A lot of effort has been made to develop intelligent agents that simulate human learning of math and science, e.g., for use in cognitive tutors. However, constructing such a learning agent currently requires manual encoding of prior domain knowledge for each domain and even for each level of problem difficulty, which hurts the generality of the learning agent and is less cognitively plausible. Li et al. (2012) recently proposed an efficient algorithm that acquires representation knowledge in the form of “deep features,” and use the acquired representation to automatically generate feature predicates to assist future learning. The authors demonstrated the generality of the proposed approach across multiple domains. The results showed that by integrating this algorithm into a simulated student, SimStudent, the extended agent achieves efficient skill acquisition, while requiring less prior knowledge engineering effort, and being a more realistic model of the state of prior knowledge of novice algebra students. In this work, we further explore the generality of the proposed approach within one domain, but across multiple difficulty levels. The results indicates that the new, extended SimStudent is able to acquire skill knowledge of harder problems using only its learned problem representations, while the original SimStudent requires its domain-specific prior knowledge to be engineered explicitly to handle these harder problems. The extended SimStudent’s performance is shown to match and even exceed the original as the complexity of problems increases.", "year": 2012, "ssId": "52540497682c4209b8e20125c8255358b22d0fa7", "arXivId": null, "link": null, "openAccess": false, "authors": ["Nan Li", "Abraham Schreiber", "William W. Cohen", "K. Koedinger"]}