{"title": "Comments", "abstract": "Abrevaya, J., Hausman, J., and Scott-Morton, F. (1998), “Identification and Estimation of Polynomial Errors-in-Variables Models,” Journal of Econometrics, 87, 239–269. Bound, J., Brown, C., Duncan, G., and Rodgers, W. (1994), “Evidence on the Validity of Cross-Sectional and Longitudinal Labor Market Data,” Journal of Labor Economics, 12, 345–368. Bound, J., Brown, C., and Mathiowetz, N. (2001), “Measurement Error in Survey Data,” in Handbook of Econometrics, Vol. 5, eds. J. J. Heckman and E. Leamer, Amsterdam: North-Holland, Chap. 59. Bound, J., and Krueger, A. (1991), “The Extent of Measurement Error in Longitudinal Earnings Data: Do Two Wrongs Make a Right,” Journal of Labor Economics, 12, 1–24. Carroll, R. J., Ruppert, D., and Stefanski, L. A. (1995), Measurement Error in Nonlinear Models, New York: Chapman & Hall. Carroll, R., and Wand, M. (1991), “Semiparametric Estimation in Logistic Measurement Error Models,” Journal of the Royal Statistical Society, 53, 573–585. Chen, X., Hong, H., and Tamer, E. (2003), “Measurement Error Models With Auxiliary Data,” working paper; forthcoming in Review of Economic Studies. Chesher, A. (1991), “The Effect of Measurement Error,” Biometrika, 78, 451–462. Frish, R. (1934), Statistical Confluence Study, Oslo: University Institute of Economics. Fuller, W. (1987), Measurement Error Models, New York: Wiley. Hausman, J., Ichimura, H., Newey, W., and Powell, J. (1991), “Measurement Errors in Polynomial Regression Models,” Journal of Econometrics, 50, 271–295. Hong, H., and Tamer, E. (2003), “A Simple Estimator for Nonlinear Errors-inVariables Models,” Journal of Econometrics, 117, 1–19. Horowitz, J., and Manski, C. (1995), “Identification and Robustness With Contaminated and Corrupted Data,” Econometrica, 63, 281–302. Hsiao, C., and Wang, L. (1995), “A Simulation Based Semi-Parametric Estimation of Nonlinear Errors-in-Variables Models,” working paper, University of Southern California. Lee, L. F., and Sepanski, J. H. (1995), “Estimation of Linear and Nonlinear Errors-in-Variables Models Using Validation Data,” Journal of the American Statistical Association, 90, 130–140. Li, T. (2002), “Robust and Consistent Estimation of Nonlinear Errors-inVariables Models,” Journal of Econometrics, 110, 1–26. Mahajan, A. (2002), “Identification and Estimation of Single Index Models With Misclassified Regressors,” working paper, Stanford University. Newey, W. (2001), “Flexible Simulated Moment Estimation of Nonlinear Errors-in-Variables Models,” Review of Economics and Statistics, 83, 616–627. Schennach, S. M. (2004), “Estimation of Nonlinear Models With Measurement Error,” Econometrica, 75, 33–75. Sepanski, J., and Carroll, R. (1993), “Semiparametric Quasi-Likelihood and Variance Estimation in Measurement Error Models,” Journal of Econometrics, 58, 223–256. Taupin, M. L. (2001), “Semiparametric Estimation in the Nonlinear Structural Errors-in-Variables Model,” The Annals of Statistics, 29, 66–93.", "year": 2005, "ssId": "525b7f73744f5650391be4678d6d51ddaf23ed72", "arXivId": null, "link": null, "openAccess": false, "authors": ["William W. Cohen", "S. Fienberg", "Pradeep Ravikumar"]}