{"title": "C OG C OMP NLP : Your Swiss Army Knife for NLP", "abstract": "Implementing a Natural Language Processing (NLP) system requires considerable engineering effort: creating data-structures to represent language constructs; reading corpora annotations into these data-structures; applying off-the-shelf NLP tools to augment the text representation; extracting features and training machine learning components; conducting experiments and computing performance statistics; and creating the end-user application that integrates the implemented components. While there are several widely used NLP libraries, each provides only partial coverage of these various tasks. We present our library COGCOMPNLP which simplifies the process of design and development of NLP applications by providing modules to address different challenges: we provide a corpus-reader module that supports popular corpora in the NLP community, a module for various low-level data-structures and operations (such as search over text), a module for feature extraction, and an extensive suite of annotation modules for a wide range of semantic and syntactic tasks. These annotation modules are all integrated in a single system, PIPELINE, which allows users to easily use the annotators with simple direct calls using any JVM-based language, or over a network. The sister project COGCOMPNLPY enables users to access the annotators with a Python interface. We give a detailed account of our system’s structure and usage, and where possible, compare it with other established NLP frameworks. We report on the performance, including time and memory statistics, of each component on a selection of well-established datasets. Our system is publicly available for research use and external contributions, at: http://github.com/CogComp/cogcomp-nlp.", "year": 2018, "ssId": "5930efbf01efa8944258b1c0f7349111702f779e", "arXivId": null, "link": null, "openAccess": false, "authors": ["Daniel Khashabi", "M. Sammons", "Ben Zhou", "Tom Redman", "Christos E. Christodoulopoulos", "Vivek Srikumar", "Nicholas Rizzolo", "Lev-Arie Ratinov", "Guanheng Luo", "Q. Do", "Chen-Tse Tsai", "Subhro Roy", "Stephen Mayhew", "Zhili Feng", "J. Wieting", "Xiaodong Yu", "Yangqiu Song", "Shashank Gupta", "Shyam Upadhyay", "N. Arivazhagan", "Qiang Ning", "Shaoshi Ling", "D. Roth"]}