{"title": "A comprehensive map of the influenza A virus replication cycle", "abstract": "BackgroundInfluenza is a common infectious disease caused by influenza viruses. Annual epidemics cause severe illnesses, deaths, and economic loss around the world. To better defend against influenza viral infection, it is essential to understand its mechanisms and associated host responses. Many studies have been conducted to elucidate these mechanisms, however, the overall picture remains incompletely understood. A systematic understanding of influenza viral infection in host cells is needed to facilitate the identification of influential host response mechanisms and potential drug targets.DescriptionWe constructed a comprehensive map of the influenza A virus (‘IAV’) life cycle (‘FluMap’) by undertaking a literature-based, manual curation approach. Based on information obtained from publicly available pathway databases, updated with literature-based information and input from expert virologists and immunologists, FluMap is currently composed of 960 factors (i.e., proteins, mRNAs etc.) and 456 reactions, and is annotated with ~500 papers and curation comments. In addition to detailing the type of molecular interactions, isolate/strain specific data are also available. The FluMap was built with the pathway editor CellDesigner in standard SBML (Systems Biology Markup Language) format and visualized as an SBGN (Systems Biology Graphical Notation) diagram. It is also available as a web service (online map) based on the iPathways+ system to enable community discussion by influenza researchers. We also demonstrate computational network analyses to identify targets using the FluMap.ConclusionThe FluMap is a comprehensive pathway map that can serve as a graphically presented knowledge-base and as a platform to analyze functional interactions between IAV and host factors. Publicly available webtools will allow continuous updating to ensure the most reliable representation of the host-virus interaction network. The FluMap is available at http://www.influenza-x.org/flumap/.", "year": 2013, "ssId": "605bae6c397e4829dde7ff7b8ddb84782ec6e607", "arXivId": null, "link": null, "openAccess": false, "authors": ["Y. Matsuoka", "Hiromi Matsumae", "Manami Katoh", "A. Eisfeld", "G. Neumann", "T. Hase", "Samik Ghosh", "J. Shoemaker", "Tiago J. S. Lopes", "Tokiko Watanabe", "Shinji Watanabe", "S. Fukuyama", "H. Kitano", "Y. Kawaoka"]}