{"title": "Shallow learning as a pathway for successful learning both for tutors and tutees", "abstract": "Shallow learning as a pathway for successful learning both for tutors and tutees Noboru Matsuda (mazda@cs.cmu.edu), Evelyn Yarzebinski (eey2@cs.cmu.edu), Victoria Keiser (keiser@cs.cmu.edu), Rohan Raizada (rohan@cs.cmu.edu), William W. Cohen (wcohen@cs.cmu.edu) School of Computer Science, Carnegie Mellon University 5000 Forbes Avenue, Pittsburgh, PA 15213, USA Gabriel Stylianides (gabriel.stylianides@education.ox.ac.uk) Department of Education, University of Oxford 15 Norham Gardens, Oxford, OX2 6PY, UK Kenneth R. Koedinger (krk@cs.cmu.edu) School of Computer Science, Carnegie Mellon University 5000 Forbes Avenue, Pittsburgh, PA 15213, USA Abstract game-like learning environment, called APLUS (Artificial Peer Learning environment Using SimStudent). The current version of APLUS allows students to learn Algebra equa- tions by teaching SimStudent. Using APLUS, we have con- ducted a number of classroom studies to advance cognitive and social theories of tutor learning (Matsuda, Keiser, et al., 2012; Matsuda et al., 2011). The goal of this paper is to investigate the relationship be- tween tutee- and tutor-learning. As previous empirical stud- ies show (e.g., Cohen, 1994), peer tutoring is known to be beneficial both for tutors and tutees. We thus hypothesize that there must be a strong correlation between SimStu- dent’s and human students’ learning. We are particularly interested in how a tutee’s shallow learning affects tutor learning. When tutoring, the tutor might fail to detect the tutee’s shallow learning by observing the tutee’s satisfactory performance at the surface level without actually probing for underlying deep understanding of the domain knowledge. However, if there is actually a symbiotic rela- tionship between tutee and tutor learning, then the tutee’s shallow learning should be detrimental to tutor learning. We are also interested in studying how tutee errors help not only tutee but also tutor learning. In a previous experi- ment, we studied a theoretical account of the impact of cor- rective feedback on SimStudent’s learning (Matsuda, et al., 2008). We found that committing errors and receiving ex- plicit corrective feedback facilitates tutee learning. On the other hand, it is also known that (human) students learn by explaining erroneous worked-out examples (Grosse & Renkl, 2006; Siegler, 2002). Therefore, tutee errors would also help tutors learn when tutors explain errors committed by tutees. The cognitive fidelity of SimStudent has been demonstrated especially in the way it makes human-like induction errors to learn incorrect skills and hence makes human-like errors when solving problems (Matsuda, Lee, Cohen, & Koedinger, 2009). Therefore, using SimStudent to understand how tutee errors affect tutor learning would be a valid research methodology. SimStudent is a computational model of learning with its cognitive fidelity of learning being demonstrated especially in the way it makes human-like errors. Using SimStudent as a teachable agent in an interactive peer-learning environment, we have investigated how tutee (i.e., SimStudent) learning af- fected tutor (i.e., human student) learning. In this paper, we are particularly interested in how tutees’ shallow learning af- fects tutor learning. We are also interested in how the errors that the tutee makes affect tutor learning. The results show that teaching SimStudent on a fixed set of problems makes students easy to tutor SimStudent, which in turn helps stu- dents learn, but is likely to allow SimStudent to commit shal- low learning, which is harmful for tutor learning. It is thus crucial to let the student detect SimStudent’s shallow learning and extend teaching until SimStudent and the student achieve satisfactory competence. Keywords: Learning by teaching; teachable agent; SimStu- dent; shallow learning; learning from errors. Introduction Studying the effect of learning by teaching through the use of teachable-agent technology is a rapidly growing research field. There have been a number of teachable agents used in empirical classroom studies, for example, Betty’s Brain (Biswas, Leelawong, Schwartz, Vye, & Vanderbilt, 2005) and TAAG (Pareto, Arvemo, Dahl, Haake, & Gulz, 2011). Researchers have explored different aspects of the effect of tutor learning, including learning meta-cognitive skills for self-regulated learning (Biswas, Jeong, Kinnebrew, Sulcer, & Roscoe, 2010), the protege effect (Chase, Chin, Oppezzo, & Schwartz, 2009), the adaptive assistance (Walker, Rummel, & Koedinger, 2009), and the effect of self-explanation (Matsuda, Keiser, et al., 2012). The teachable agent we have developed is called SimStu- dent. SimStudent is a machine-learning agent that learns procedural problem-solving skills from examples (Matsuda, Cohen, Sewall, Lacerda, & Koedinger, 2008). SimStudent can be interactively tutored (aka, learning from tutored problem-solving), and has been integrated into an on-line,", "year": 2012, "ssId": "66081634c17b089cb47fd1b0ad7ad842c7fb3f87", "arXivId": null, "link": null, "openAccess": false, "authors": ["Noboru Matsuda", "Evelyn Yarzebinski", "Victoria Keiser", "R. Raizada", "William W. Cohen", "Gabriel J. Stylianides", "K. Koedinger"]}