{"title": "Integrated network analysis reveals a novel role for the cell cycle in 2009 pandemic influenza virus-induced inflammation in macaque lungs", "abstract": "BackgroundAnnually, influenza A viruses circulate the world causing wide-spread sickness, economic loss, and death. One way to better defend against influenza virus-induced disease may be to develop novel host-based therapies, targeted at mitigating viral pathogenesis through the management of virus-dysregulated host functions. However, mechanisms that govern aberrant host responses to influenza virus infection remain incompletely understood. We previously showed that the pandemic H1N1 virus influenza A/California/04/2009 (H1N1; CA04) has enhanced pathogenicity in the lungs of cynomolgus macaques relative to a seasonal influenza virus isolate (A/Kawasaki/UTK-4/2009 (H1N1; KUTK4)).ResultsHere, we used microarrays to identify host gene sequences that were highly differentially expressed (DE) in CA04-infected macaque lungs, and we employed a novel strategy – combining functional and pathway enrichment analyses, transcription factor binding site enrichment analysis and protein-protein interaction data – to create a CA04 differentially regulated host response network. This network describes enhanced viral RNA sensing, immune cell signaling and cell cycle arrest in CA04-infected lungs, and highlights a novel, putative role for the MYC-associated zinc finger (MAZ) transcription factor in regulating these processes.ConclusionsOur findings suggest that the enhanced pathology is the result of a prolonged immune response, despite successful virus clearance. Most interesting, we identify a mechanism which normally suppresses immune cell signaling and inflammation is ineffective in the pH1N1 virus infection; a dyregulatory event also associated with arthritis. This dysregulation offers several opportunities for developing strain-independent, immunomodulatory therapies to protect against future pandemics.", "year": 2012, "ssId": "6a173e22819480b891306eac65fd44be010dfca8", "arXivId": null, "link": null, "openAccess": false, "authors": ["J. Shoemaker", "S. Fukuyama", "A. Eisfeld", "Yukiko Muramoto", "Shinji Watanabe", "Tokiko Watanabe", "Y. Matsuoka", "H. Kitano", "Y. Kawaoka"]}