{"title": "Roles of GP33, a guinea pig cytomegalovirus-encoded G protein-coupled receptor homolog, in cellular signaling, viral growth and inflammation in vitro and in vivo", "abstract": "Cytomegaloviruses (CMVs) encode cellular homologs to evade host immune functions. In this study, we analyzed the roles of GP33, a guinea pig CMV (GPCMV)-encoded G protein-coupled receptor (GPCR) homolog, in cellular signaling, viral growth and pathogenesis. The cDNA structure of GP33 was determined by RACE. The effects of GP33 on some signaling pathways were analyzed in transient transfection assays. The redET two-step recombination system for a BAC containing the GPCMV genome was used to construct a mutant GPCMV containing an early stop codon in the GP33 gene (Δ33) and a rescued GPCMV (r33). We found the following: 1) GP33 activated the CRE- and NFAT-, but not the NFκB-mediated signaling pathway. 2) GP33 was dispensable for infection in tissue cultures and in normal animals. 3) In pregnant animals, viral loads of r33 in the livers, lungs, spleens, and placentas at 6 days post-infection were higher than those of Δ33, although the viruses were cleared by 3 weeks post-infection. 4) The presence of GP33 was associated with frequent lesions, including alveolar hemorrhage in the lungs, and inflammation in the lungs, livers, and spleens of the dams. Our findings suggest that GP33 has critical roles in the pathogenesis of GPCMV during pregnancy. We hypothesize that GP33-mediated signaling activates cytokine secretion from the infected cells, which results in inflammation in some of the maternal organs and the placentas. Alternatively, GP33 may facilitate transient inflammation that is induced by the chemokine network specific to the pregnancy.", "year": 2018, "ssId": "6bfeb25ea4bb41ab0840bb1be09f9b2de7eea8e4", "arXivId": null, "link": null, "openAccess": false, "authors": ["Miei Takeda", "Shinji Watanabe", "H. Katano", "Kazuma Noguchi", "Yuko Sato", "Sayaka Kojima", "T. Miura", "R. Majima", "Souichi Yamada", "N. Inoue"]}