{"title": "Defining Reasonably Foreseeable Parameter Ranges Using Real-World Traffic Data for Scenario-Based Safety Assessment of Automated Vehicles", "abstract": "Verification and validation of automated driving systems’ safety are some of the biggest challenges for the introduction of automated vehicles into the market. Scenario-based safety assessment is an efficient and repeatable method to test the systems’ safety before their deployment in the real world. However, even with limited traffic situations identified as critical to the system behavior, there is still an open range of parameters to describe each situation. Thus, defining specific parameter ranges is crucial to realize the scenario-based safety assessment approach. This study proposes a method to parameterize scenarios extracted from real-world traffic data, analyze their distribution and correlation, and incorporate them into the definition of reasonably foreseeable parameter ranges through the contextualization of resulting ranges with reasonable risk acceptance thresholds from different fields and international environments. Representative values can be selected from these specific parameter ranges to extract specific concrete scenarios applicable for the systems safety assessment. The applicability of the proposed method is demonstrated using parameter ranges obtained to define two sets of 960 cut-in and 6,442 deceleration scenarios extracted from a new set of traffic data collected from Japanese highways under the SAKURA initiative. The outcomes will enable comparisons with traffic data from other countries and inform automated driving system developers, standardization bodies, and policymakers to develop automated vehicle safety assessments applicable internationally.", "year": 2022, "ssId": "6dd6d4dfc3cf9ff41aad7e903cf1294de2ac5629", "arXivId": null, "link": null, "openAccess": false, "authors": ["H. Nakamura", "H. Muslim", "R. Kato", "Shinji Watanabe", "H. Kaneko", "H. Imanaga", "J. Antona-Makoshi", "S. Kitajima", "N. Uchida", "E. Kitahara", "K. Ozawa", "S. Taniguchi"]}