{"title": "GOP performance improvement of automatic pronunciation assessment in a noisyenvironment", "abstract": "Compared to traditional language education methodologies, CALL systems have many potential benefits. CALL systems are faster and cheaper which allow learners to get feedback immediately and study by themselves without requiring the sole attention of a teacher. In CALL systems, a good pronunciation evaluation method is needed to inform learners about their proficiency and to correct their pronunciations. However the evaluation methods in current CALL systems are still not as good as human teachers. Previous research has shown that computer evaluation systems are less robust than human teachers when facing poor quality audio files, while human evaluation remains consistent [1]. Many factors may affect the quality of a audio file, including using low quality microphones, setting up recording software incorrectly, and background noise generated from other learners. Recently, more and more educational facilities have begun to utilize CALL systems during classes. When ASR-based technologies are used, noise from other learners may be recorded at the same time which will negatively impact the performance of automatic evaluation approaches, especially when surrounding students are very active. In order to improve the robustness of automatic pronunciation evaluation in CALL systems, we investigated the effect of using a noise reduction technique in automatic pronunciation proficiency estimation. Here, we tested SPLICE [2], which is a noise reduction algorithm in the presence of additive noise, channel distortion, or a combination of the two. It is efficient especially when the distortion characteristics are known beforehand and is used in ASR systems to reduce the degradation caused by mismatches between training data and testing environments. In a noisy classroom, the main noise sources are speech from surrounding students and some microphone noise caused by touching a microphone to adjust its position and direction. Therefore it seems reasonable to use SPLICE to solve the problem. In this paper we use a GOP-based pronunciation scoring system [3] as baseline system and evaluate the effect of SPLICE on it. GOP is an acoustic likelihood-based method for automatic pronunciation assessment based on Hidden Markov Models (HMMs). GOP is especially efficient in evaluating the proficiency of pronunciations. As well as reading speech, GOP was also used to evaluate the utter-", "year": 2012, "ssId": "6fde1c63b1a353cf539d319341ae9396000660ed", "arXivId": null, "link": null, "openAccess": false, "authors": ["Yi Luan", "M. Suzuki", "Yutaka Yamauchi", "N. Minematsu", "Shuhei Kato", "K. Hirose"]}