{"title": "Underspecification Presents Challenges for Credibility in Modern Machine Learning", "abstract": "ML models often exhibit unexpectedly poor behavior when they are deployed in real-world domains. We identify underspecification as a key reason for these failures. An ML pipeline is underspecified when it can return many predictors with equivalently strong held-out performance in the training domain. Underspecification is common in modern ML pipelines, such as those based on deep learning. Predictors returned by underspecified pipelines are often treated as equivalent based on their training domain performance, but we show here that such predictors can behave very differently in deployment domains. This ambiguity can lead to instability and poor model behavior in practice, and is a distinct failure mode from previously identified issues arising from structural mismatch between training and deployment domains. We show that this problem appears in a wide variety of practical ML pipelines, using examples from computer vision, medical imaging, natural language processing, clinical risk prediction based on electronic health records, and medical genomics. Our results show the need to explicitly account for underspecification in modeling pipelines that are intended for real-world deployment in any domain.", "year": 2020, "ssId": "71a85e735a3686bef8cce3725ae5ba82e2cabb1b", "arXivId": "2011.03395", "link": "https://arxiv.org/pdf/2011.03395.pdf", "openAccess": true, "authors": ["A. D'Amour", "K. Heller", "D. Moldovan", "Ben Adlam", "B. Alipanahi", "Alex Beutel", "Christina Chen", "Jonathan Deaton", "Jacob Eisenstein", "M. Hoffman", "F. Hormozdiari", "N. Houlsby", "Shaobo Hou", "Ghassen Jerfel", "A. Karthikesalingam", "Mario Lucic", "Yi-An Ma", "C. McLean", "Diana Mincu", "A. Mitani", "A. Montanari", "Zachary Nado", "Vivek Natarajan", "Christopher Nielson", "T. F. Osborne", "R. Raman", "K. Ramasamy", "R. Sayres", "J. Schrouff", "Martin G. Seneviratne", "Shannon Sequeira", "Harini Suresh", "Victor Veitch", "Max Vladymyrov", "Xuezhi Wang", "Kellie Webster", "S. Yadlowsky", "Taedong Yun", "Xiaohua Zhai", "D. Sculley"]}