{"title": "Shredder: Learning Noise to Protect Privacy with Partial DNN Inference on the Edge", "abstract": "A wide variety of DNN applications increasingly rely on the cloud to perform their huge computation. This heavy trend toward cloud-hosted inference services raises serious privacy concerns. This model requires the sending of private and privileged data over the network to remote servers, exposing it to the service provider. Even if the provider is trusted, the data can still be vulnerable over communication channels or via side-channel attacks [1,2] at the provider. To that end, this paper aims to reduce the information content of the communicated data without compromising the cloud service's ability to provide a DNN inference with acceptably high accuracy. This paper presents an end-to-end framework, called Shredder, that, without altering the topology or the weights of a pre-trained network, learns an additive noise distribution that significantly reduces the information content of communicated data while maintaining the inference accuracy. Shredder learns the additive noise by casting it as a tensor of trainable parameters enabling us to devise a loss functions that strikes a balance between accuracy and information degradation. The loss function exposes a knob for a disciplined and controlled asymmetric trade-off between privacy and accuracy. While keeping the DNN intact, Shredder enables inference on noisy data without the need to update the model or the cloud. Experimentation with real-world DNNs shows that Shredder reduces the mutual information between the input and the communicated data to the cloud by 70.2% compared to the original execution while only sacrificing 1.46% loss in accuracy.", "year": 2019, "ssId": "80a085a79ac6cee94f21d21ab8ca302458c4e131", "arXivId": "1905.11814", "link": "https://arxiv.org/pdf/1905.11814.pdf", "openAccess": true, "authors": ["FatemehSadat Mireshghallah", "Mohammadkazem Taram", "Prakash Ramrakhyani", "D. Tullsen", "H. Esmaeilzadeh"]}