{"title": "SunPy: A Python package for Solar Physics", "abstract": "Stuart J. Mumford∗1, 2, 3, Nabil Freij4, Steven Christe5, Jack Ireland5, Florian Mayer6, V. Keith Hughitt7, Albert Y. Shih5, Daniel F. Ryan8, 5, Simon Liedtke6, David Pérez-Suárez9, Pritish Chakraborty10, Vishnunarayan K I.6, Andrew Inglis11, Punyaslok Pattnaik12, Brigitta Sipőcz13, Rishabh Sharma6, Andrew Leonard3, David Stansby14, Russell Hewett15, Alex Hamilton6, Laura Hayes5, Asish Panda6, Matt Earnshaw6, Nitin Choudhary16, Ankit Kumar6, Prateek Chanda17, Md Akramul Haque18, Michael S Kirk11, Michael Mueller6, Sudarshan Konge6, Rajul Srivastava6, Yash Jain19, Samuel Bennett6, Ankit Baruah6, Will Barnes20, Michael Charlton6, Shane Maloney21, Nicky Chorley22, Himanshu6, Sanskar Modi6, James Paul Mason6, Naman96396, Jose Ivan Campos Rozo23, Larry Manley6, Agneet Chatterjee24, John Evans6, Michael Malocha6, Monica G. Bobra25, Sourav Ghosh24, Airmansmith976, Dominik Stańczak26, Ruben De Visscher6, Shresth Verma27, Ankit Agrawal6, Dumindu Buddhika6, Swapnil Sharma6, Jongyeob Park28, Matt Bates6, Dhruv Goel6, Garrison Taylor29, Goran Cetusic6, Jacob6, Mateo Inchaurrandieta6, Sally Dacie30, Sanjeev Dubey6, Deepankar Sharma6, Erik M. Bray6, Jai Ram Rideout31, Serge Zahniy5, Tomas Meszaros6, Abhigyan Bose6, André Chicrala32, Ankit6, Chloé Guennou6, Daniel D’Avella6, Daniel Williams33, Jordan Ballew6, Nick Murphy34, Priyank Lodha6, Thomas Robitaille6, Yash Krishan6, Andrew Hill6, Arthur Eigenbrot35, Benjamin Mampaey36, Bernhard M. Wiedemann6, Carlos Molina6, Duygu Keşkek6, Ishtyaq Habib6, Joseph Letts6, Juanjo Bazán37, Quinn Arbolante38, Reid Gomillion6, Yash Kothari6, Yash Sharma6, Abigail L. Stevens39, 40, Adrian Price-Whelan41, Ambar Mehrotra6, Arseniy Kustov6, Brandon Stone6, Trung Kien Dang42, Emmanuel Arias6, Fionnlagh Mackenzie Dover1, Freek Verstringe36, Gulshan Kumar43, Harsh Mathur44, Igor Babuschkin6, Jaylen Wimbish6, Juan Camilo Buitrago-Casas6, Kalpesh Krishna45, Kaustubh Hiware46, Manas Mangaonkar6, Matthew Mendero6, Mickaël Schoentgen6, Norbert G Gyenge47, Ole Streicher48, Rajasekhar Reddy Mekala6, Rishabh Mishra6, Shashank Srikanth43, Sarthak Jain6, Tannmay Yadav49, Tessa D. Wilkinson6, Tiago M. D. Pereira50, 51, Yudhik Agrawal12, jamescalixto6, yasintoda6, and Sophie A. Murray52", "year": 2020, "ssId": "84e566e326b64b105cabf0c47dff336c4f632a1c", "arXivId": null, "link": null, "openAccess": false, "authors": ["S. Mumford", "N. Freij", "S. Christe", "J. Ireland", "F. Mayer", "V. Hughitt", "A. Shih", "D. Ryan", "Simon Liedtke", "D. Pérez-Suárez", "Pritish Chakraborty", "K. Vishnunarayan", "A. Inglis", "Punyaslok Pattnaik", "B. Sipocz", "Rishabh Sharma", "A. Leonard", "D. Stansby", "Russell J. Hewett", "Alex Hamilton", "L. Hayes", "A. Panda", "M. Earnshaw", "Nitin Choudhary", "Ankit Kumar", "Prateek Chanda", "Haque", "M. Kirk", "Michael Mueller", "Sudarshan Konge", "Rajul Srivastava", "Y. Jain", "Samuel Bennett", "Ankit Baruah", "W. Barnes", "Michael C. Charlton", "S. Maloney", "N. Chorley", "Himanshu", "Sanskar Modi", "James Mason", "Naman", "J. Rozo", "L. Manley", "Agneet Chatterjee", "John G Evans", "Michael Malocha", "M. Bobra", "Sourav Ghosh", "Airmansmith", "D. Stańczak", "R. Visscher", "Shresth Verma", "Ankit Agrawal", "Dumindu Buddhika", "Swapnil Sharma", "Jongyeob Park", "M. Bates", "Dhruv Goel", "Garrison Taylor", "Goran Cetušić", "Jacob", "Mateo Inchaurrandieta", "S. Dacie", "Sanjeev Dubey", "Deepankar Sharma", "E. Bray", "J. Rideout", "S. Zahniy", "T. Mészáros", "Abhigyan Bose", "André Chicrala", "Ankit", "C. Guennou", "D. D'Avella", "Daniel Williams", "J. Ballew", "N. Murphy", "P. Lodha", "T. Robitaille", "Yash Krishan", "Andrew Hill", "A. Eigenbrot", "B. Mampaey", "Bernhard M. Wiedemann", "Carlos Molina", "Duygu Keşkek", "Ishtyaq Habib", "Joseph Letts", "Juanjo Bazán", "Quinn Arbolante", "Reid Gomillion", "Yash Kothari", "Yash Sharma", "A. Stevens", "A. Price-Whelan", "Ambar Mehrotra", "A. Kustov", "Brandon Stone", "Trung Kien Dang", "Emmanuel Arias", "F. Dover", "F. Verstringe", "Gulshan Kumar", "Harsh Mathur", "I. Babuschkin", "J. Wimbish", "J. Buitrago-Casas", "Kalpesh Krishna", "Kaustubh Hiware", "Manasi D. Mangaonkar", "Matthew Mendero", "Mickaël Schoentgen", "N. Gyenge", "O. Streicher", "R. Mekala", "R. Mishra", "Shashank Srikanth", "Sarthak Jain", "Tannmay Yadav", "T. Wilkinson", "T. Pereira", "Yudhik Agrawal", "Jamescalixto", "Yasintoda", "S. Murray"]}