{"title": "Multi-Stream End-to-End Speech Recognition", "abstract": "Attention-based methods and Connectionist Temporal Classification (CTC) network have been promising research directions for end-to-end (E2E) Automatic Speech Recognition (ASR). The joint CTC/Attention model has achieved great success by utilizing both architectures during multi-task training and joint decoding. In this article, we present a multi-stream framework based on joint CTC/Attention E2E ASR with parallel streams represented by separate encoders aiming to capture diverse information. On top of the regular attention networks, the Hierarchical Attention Network (HAN) is introduced to steer the decoder toward the most informative encoders. A separate CTC network is assigned to each stream to force monotonic alignments. Two representative framework have been proposed and discussed, which are Multi-Encoder Multi-Resolution (MEM-Res) framework and Multi-Encoder Multi-Array (MEM-Array) framework, respectively. In MEM-Res framework, two heterogeneous encoders with different architectures, temporal resolutions and separate CTC networks work in parallel to extract complementary information from same acoustics. Experiments are conducted on Wall Street Journal (WSJ) and CHiME-4, resulting in relative Word Error Rate (WER) reduction of <inline-formula><tex-math notation=\"LaTeX\">$\\text{18.0}\\!-\\!\\text{32.1}\\%$</tex-math></inline-formula> and the best WER of <inline-formula><tex-math notation=\"LaTeX\">$\\text{3.6}\\%$</tex-math></inline-formula> in the WSJ eval92 test set. The MEM-Array framework aims at improving the far-field ASR robustness using multiple microphone arrays which are activated by separate encoders. Compared with the best single-array results, the proposed framework has achieved relative WER reduction of <inline-formula><tex-math notation=\"LaTeX\">$\\text{3.7}\\%$</tex-math></inline-formula> and <inline-formula><tex-math notation=\"LaTeX\">$\\text{9.7}\\%$</tex-math></inline-formula> in AMI and DIRHA multi-array corpora, respectively, which also outperforms conventional fusion strategies.", "year": 2019, "ssId": "84f2cfbc142ad3165ea3bcacd189a3d1110660e0", "arXivId": "1906.08041", "link": "https://arxiv.org/pdf/1906.08041.pdf", "openAccess": true, "authors": ["Ruizhi Li", "Xiaofei Wang", "Sri Harish Reddy Mallidi", "Shinji Watanabe", "Takaaki Hori", "H. Hermansky"]}