{"title": "Hemoglobin A1c Levels Affect Visit-to-visit Variability of Lipid Profiles in Patients Undergoing Elective Percutaneous Coronary Intervention: A Retrospective Study", "abstract": "\n BackgroundBoth hemoglobin A1c (HbA1c) levels and visit-to-visit variability of lipid profiles are risk factors for cardiovascular disease (CVD). We conducted a retrospective cohort study to explore the relationship between HbA1c and lipid variability.MethodsWe retrospectively collected baseline and follow-up data on patients who underwent elective percutaneous coronary intervention (PCI) from January 2009 to April 2019. Univariate and multivariate linear regression analyses were performed to assess the association between HbA1c and lipid variability. Subgroup analyses employed multivariate linear regression analyses.ResultsA total of 4,445 patients were enrolled in the study. The median age and value of HbA1c were 64yrs old and 5.9%, respectively, 64% had hypertension and 25.5% diabetes. The variability of low-density lipoprotein cholesterol (LDL-C), non-high-density lipoprotein cholesterol (non-HDL-C), total cholesterol (TC), and triglyceride (TG) was each significantly higher in patients with HbA1c≥6.5% than those with HbA1c＜6.5% group. Multivariate linear regression indicated that HbA1c level was a potential risk factor for the variability of LDL-C, non-HDL-C, TC and TG, which was independent of the mean values of lipids. Subgroup analyses demonstrated that the relationship between HbA1c and the variability of LDL-C, non-HDL-C, TC, and TG did not importantly vary across several subgroups. These results remained consistent when lipid variability was represented by the standard deviation (SD), coefficient of variation (CV) and variability independent of the mean (VIM), respectively.ConclusionHbA1c is a potential risk factor for the variability of LDL-C, non-HDL-C, TC and TG in patients undergoing elective PCI.", "year": 2020, "ssId": "899055ad2f0863cf1931c41f04da8b1dd7382607", "arXivId": null, "link": null, "openAccess": false, "authors": ["Duanbin Li", "Cao Wang", "Liding Zhao", "Yi Luan", "Ya Li", "G. Fu", "Zhao-yang Chen", "Wenbin Zhang"]}