{"title": "Performance improvement of exemplar-based noise robust ASR using speaker normalization methods", "abstract": "The Automatic Speech Recognition (ASR) technology now has been proved to have desirable performance on an environment that is exactly the same as their observed in training the recognition model. The HMM is the most popular and successful stochastic approach to speech recognition in general use, due to the existence of elegant and efficient algorithms for both training and recognition. However, in the actual world, it is very hard to predict what kind of acoustic condition the speakers speak in. Therefore, background noise, channel distortion and speaker variations sometimes show great mismatch between the training and testing conditions, which often causes a dramatic degradation in performance of the ASR systems. There have been numerous approaches that aim at reducing this mismatch [1]. The approaches can be split into three categories. Firstly, inherently robust parametrisation of speech may be used, such as Histogram Equalization and Linear Discriminant Analysis [3]. Alternatively, the clean speech may be estimated from its corrupted version, then the standard acoustic models may be used as they are. The famous approaches are Spectral Subtraction [4], Vocal Tract Length Normalization (VTLN), Stereobased Piecewise Linear Compensation for Environments [6] and Vector Taylor Series approaches [7]. Finally, make the models fitted to the testing conditition. For example, Maximum Likelihood Linear Regression (MLLR) uses a set of linear transforms to adapt the model parameters to a new acoustic condition. Recently a class of methods that has gained recent prominence is based on compositional models: noisy speech spectra are represented as a linear, typically sparse, combination of basis atoms describing the individual speech and noise sources. The collection of atoms here is called a dictionary, which includes both clean speech exemplars and noise exemplars [8]. The sparse representation is obtained by finding the sparsest possible linear combination that describes the observed signal well, using techniques best known as non-negative matrix factorisation (NMF) [9]. Reconstruction of an observed spectrum using parts of the dictionary can be used to separate the spectrum into clean and noisy spectra and the clean spectrum will be used for recognition. However, this approach has two problems. First,", "year": 2014, "ssId": "8afbc4188be9e9452ce1fe868ebe217179d36793", "arXivId": null, "link": null, "openAccess": false, "authors": ["Yi Luan", "D. Saito", "Yosuke Kashiwagi", "N. Minematsu", "K. Hirose"]}