{"title": "Variability in blood lipids affects the neutrophil to lymphocyte ratio in patients undergoing elective percutaneous coronary intervention: A retrospective study", "abstract": "\n Background: Atherosclerosis is associated with chronic inflammation and lipid metabolism. The neutrophil to lymphocyte ratio (NLR) as an indicator of inflammation has been confirmed to be associated with cardiovascular disease prognosis. However, few studies have explored the effects of blood lipid variability on NLR. The aim of this study was to explore the relationship between variability in blood lipid levels and NLR. Methods: The association between variability in blood lipids and NLR was assessed with both univariate and multivariate linear regression. Multivariate linear regression was also performed for a subgroup analysis. Results: The variability of high-density lipoprotein cholesterol (HDL-C) (regression coefficients [β] 4.008, standard error (SE) 0.503, P-value<0.001) and low-density lipoprotein cholesterol (LDL-C) ([β] 0.626, SE 0.164, P-value<0.001) were risk factors for the NLR value, although baseline LDL-C and HDL-C were not risk factors for NLR values. Variability of HDL-C ([β] 4.328, SE 0.578, P-value<0.001) and LDL-C ([β] 0.660, SE 0.183, P-value<0.001) were risk factors for NLR variability. Subgroup analysis demonstrated that the relationship between variability of LDL-C and NLR was consistent with the trend of the total sample for those with diabetes mellitus, controlled blood lipid, statins, atorvastatin. The relationship between the variability of HDL-C and NLR was consistent with the trend of the total sample in all subgroups. Conclusion: The variability of HDL-C and LDL-C are risk factors for the value and variability of NLR, while the relationship between variability of HDL-C and NLR is more stable than the variability of LDL-C in the subgroup analysis, which provides a new perspective for controlling inflammation in patients undergoing PCI.", "year": 2020, "ssId": "8dd3b88ac87372c9f4428029ac12288ff3405199", "arXivId": null, "link": null, "openAccess": false, "authors": ["Liding Zhao", "Tian Xu", "Ya Li", "Yi Luan", "Q. Lv", "G. Fu", "Wenbin Zhang"]}