{"title": "Logspace Reducibility From Secret Leakage Planted Clique", "abstract": "The planted clique problem is well-studied in the context of observing, explaining, and predicting interesting computational phenomena associated with statistical problems. When equating computational efficiency with the existence of polynomial time algorithms, the computational hardness of (some variant of) the planted clique problem can be used to infer the computational hardness of a host of other statistical problems. Is this ability to transfer computational hardness from (some variant of) the planted clique problem to other statistical problems robust to changing our notion of computational efficiency to space efficiency? We answer this question affirmatively for three different statistical problems, namely Sparse PCA [BR13a], submatrix detection [MW15], and testing almost k-wise independence [AAK07]. The key challenge is that space efficient randomized reductions need to repeatedly access the randomness they use. Known reductions to these problems are all randomized and need polynomially many random bits to implement. Since we can not store polynomially many random bits in memory, it is unclear how to implement these existing reductions space efficiently. There are two ideas involved in circumventing this issue and implementing known reductions to these problems space efficiently. 1. When solving statistical problems, we can use parts of the input itself as randomness. This idea was pioneered by [GW02] in the context of derandomizing ‘typically correct’ algorithms. Our observation is that this is useful even if we do not care about derandomization, and instead care about repeatedly accessing randomness that can not be stored in working memory. 2. Secret leakage variants of the planted clique problem with appropriate secret leakage can be more useful than the standard planted clique problem when we want to use parts of the input as randomness. The idea that secret leakage is helpful in the context of polynomial time reducibility to statistical problems was introduced by [BB20]. They demonstrated the polynomial time hardness of a wide variety of statistical problems by assuming polynomial time hardness of secret leakage variants of the planted clique problem. Our observation is that leakage is useful even for the seemingly unrelated task of finding randomness in the input.", "year": 2021, "ssId": "9045bf2a9c1e2b9621c69c57f991d10880e91f18", "arXivId": "2107.11886", "link": "https://arxiv.org/pdf/2107.11886.pdf", "openAccess": true, "authors": ["Jay Mardia"]}