{"title": "An algorithm for making a correspondence of zero-crossing points in a wavelet transform domain with second-order derivative property", "abstract": "The multiscale wavelet transform (MWT) is the method of multiple resolution analysis using the wavelet transform. In MWT with the property of the second-order derivative, the position of the zero-crossing point of the transform signal corresponds to the position of the edge of the original signal. the edge has an important role in image information. If the correspondence of the zero-crossing points related to the edges can be established between scanning lines or between frames by some means, the correspondence can be utilized in the sophistication of image processing (such as motion analysis, stereo matching, interpolation, and noise reduction). From such a viewpoint, this paper discusses the correspondence between the zero-crossing points in MWT, i.e., the correspondence of scales and the correspondence between two similar signals, and presents a method that provides visually plausible correspondence as a result. Especially for the correspondence between signals, the accuracy of the correspondence of zero-crossing points is improved by introducing the cost function. Computational complexity is kept within a practical range, by applying the dynamic programming and utilizing the branch structure of the zero-crossing points among various scales. the idea of cross-validation is applied to the correspondence of signals between the scanning lines of the image, and a method is composed that evaluates visually the quality of the signal correspondence method by the naked-eye observation of this image. With this evaluation method, the usefulness of the proposed algorithm for the signal correspondence and its problems are indicated. It is shown that a visually reasonable result is obtained by adjusting the weight coefficient of the multiplication factor of the cost function in the signal correspondence process.", "year": 1995, "ssId": "9e3e6ddf958c2005f7041cc9dd5fe050a0dbd02e", "arXivId": null, "link": null, "openAccess": false, "authors": ["Shinji Watanabe", "Takahiro Saito", "C. Cheong", "K. Aizawa"]}