{"title": "SimStudent : Building an Intelligent Tutoring System by Tutoring a Synthetic Student", "abstract": "SimStudent is a machine-learning agent that has been developed to help novice authors to build Intelligent Tutoring Systems (ITS) without heavy programming. Integrated into an existing suite of software tools called CTAT (Cognitive Tutor Authoring Tools), SimStudent helps authors to create an expert model for ITS by “teaching” SimStudent how to solve problems. There are two ways for the author to teach SimStudent: by demonstrating solutions or by tutoring SimStudent. In the former approach, the author demonstrates solution steps, and SimStudent attempts to induce underlying domain principles by generalizing those demonstrations. In the latter approach, the author gives SimStudent problems to solve, and provides feedback on the steps performed by SimStudent, and also gives “hints” for steps that SimStudent cannot perform (where the hints consist of demonstrating that particular step). To evaluate which authoring strategy better facilitates authoring, we conducted two studies. The first measured the quality of the expert model; here the authoring processes were simulated by using pre-recorded solutions for demonstrations as well as using an existing Cognitive Tutor for tutoring SimStudent. The second study measured the time for authoring; here a human author was actually using SimStudent to author a Cognitive Tutor. The results show the following: (1) Authoring by demonstration requires more time than authoring by tutoring, because when authoring by demonstration, the author frequently needs to test the quality of the expert model to determine if more demonstration is needed. In contrast, when authoring by tutoring, this decision making can be done naturally by observing SimStudent’s performance during tutoring. (2) The expert model generated with authoring by tutoring tends to be more precise than authoring by demonstration. That is, when applied to solve problems, the expert model generated by tutoring makes more correct steps and/or fewer incorrect ones.", "year": 2008, "ssId": "a3cc75975a5998d5a7dd494e70a479ba0a550013", "arXivId": null, "link": null, "openAccess": false, "authors": ["Noboru Matsuda", "William W. Cohen", "J. Sewall", "Gustavo Lacerda", "K. Koedinger"]}