{"title": "Elevation of Hemoglobin A1c Increases the Atherosclerotic Plaque Vulnerability and the Visit-to-Visit Variability of Lipid Profiles in Patients Who Underwent Elective Percutaneous Coronary Intervention", "abstract": "Background Increased plaque vulnerability and higher lipid variability are causes of adverse cardiovascular events. Despite a close association between glucose and lipid metabolisms, the influence of elevated glycated hemoglobin A1c (HbA1c) on plaque vulnerability and lipid variability remains unclear. Methods Among subjects undergoing percutaneous coronary intervention (PCI) from 2009 through 2019, 366 patients received intravascular optical coherence tomography (OCT) assessment and 4,445 patients underwent the scheduled follow-ups within 1 year after PCI. Vulnerability features of culprit vessels were analyzed by OCT examination, including the assessment of lipid, macrophage, calcium, and minimal fibrous cap thickness (FCT). Visit-to-visit lipid variability was determined by different definitions including standard deviation (SD), coefficient of variation (CV), and variability independent of the mean (VIM). Multivariable linear regression analysis was used to verify the influence of HbA1c on plaque vulnerability features and lipid variability. Exploratory analyses were also performed in non-diabetic patients. Results Among enrolled subjects, the pre-procedure HbA1c was 5.90 ± 1.31%, and the average follow-up HbA1c was 5.98 ± 1.16%. By OCT assessment, multivariable linear regression analyses demonstrated that patients with elevated HbA1c had a thinner minimal FCT (β = −6.985, P = 0.048), greater lipid index (LI) (β = 226.299, P = 0.005), and higher macrophage index (β = 54.526, P = 0.045). Even in non-diabetic patients, elevated HbA1c also linearly decreased minimal FCT (β = −14.011, P = 0.036), increased LI (β = 290.048, P = 0.041) and macrophage index (β = 120.029, P = 0.048). Subsequently, scheduled follow-ups were performed during 1-year following PCI. Multivariable linear regression analyses proved that elevated average follow-up HbA1c levels increased the VIM of lipid profiles, including low-density lipoprotein cholesterol (β = 2.594, P < 0.001), high-density lipoprotein cholesterol (β = 0.461, P = 0.044), non-high-density lipoprotein cholesterol (β = 1.473, P < 0.001), total cholesterol (β = 0.947, P < 0.001), and triglyceride (β = 4.217, P < 0.001). The result was consistent in non-diabetic patients and was verified when SD and CV were used to estimate variability. Conclusion In patients undergoing elective PCI, elevated HbA1c increases the atherosclerotic plaque vulnerability and the visit-to-visit variability of lipid profiles, which is consistent in non-diabetic patients.", "year": 2022, "ssId": "a3da7028a1b721e392c421c2f15096abb1a71afb", "arXivId": null, "link": null, "openAccess": false, "authors": ["Duanbin Li", "Ya Li", "Cao Wang", "Hangpan Jiang", "Liding Zhao", "Xu-Lin Hong", "Maoning Lin", "Yi Luan", "Xiaohua Shen", "Zhaoyang Chen", "Wenbin Zhang"]}