{"title": "Measurement Based As-You-Go Deployment of Two-Connected Wireless Relay Networks", "abstract": "Motivated by the need for impromptu or as-you-go deployment of wireless sensor networks in some situations, we study the problem of optimal sequential deployment of wireless sensors and relays along a line (e.g., a forest trail) of unknown length. Starting from the sink node (e.g., a base station), a ”deployment agent„ walks along the line, stops at equally spaced points (”potential„ relay locations), placing relays at some of these points, until he reaches a location at which the source node (i.e., the sensor) needs to be placed, the objective being to create a multihop wireless relay network between the source and the sink. The deployment agent decides whether to place a relay or not at each of the potential locations, depending upon the link quality measurements to the previously placed relays. In this article, we seek to design efficient deployment algorithms for this class of problems, to achieve the objective of 2-connectivity in the deployed network. We ensure multi-connectivity by allowing each node to communicate with more than one neighbouring node. By proposing a network cost objective that is additive over the deployed relays, we formulate the relay placement problem as a Markov decision process. We provide structural results for the optimal policy and evaluate the performance of the optimal policy via numerical exploration. Computation of such an optimal deployment policy requires a statistical model for radio propagation; we extract this model from the raw data collected via measurements in a forestlike environment. To validate the results obtained from the numerical study, we provide an experimental study of algorithms for 2-connected network deployment.", "year": 2017, "ssId": "a427334e296b6be27c3a9c7d6b942d6468e487b8", "arXivId": null, "link": null, "openAccess": false, "authors": ["Avishek Ghosh", "Arpan Chattopadhyay", "A. Arora", "Anurag Kumar"]}