{"title": "Cross-platform spread: vaccine-related content, sources, and conspiracy theories in YouTube videos shared in early Twitter COVID-19 conversations", "abstract": "ABSTRACT High uptake of vaccinations is essential in fighting infectious diseases, including severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) that causes the ongoing coronavirus disease 2019 (COVID-19) pandemic. Social media play a crucial role in propagating misinformation about vaccination, including through conspiracy theories and can negatively impact trust in vaccination. Users typically engage with multiple social media platforms; however, little is known about the role and content of cross-platform use in spreading vaccination-related information. This study examined the content and dynamics of YouTube videos shared in vaccine-related tweets posted to COVID-19 conversations before the COVID-19 vaccine rollout. We screened approximately 144 million tweets posted to COVID-19 conversations and identified 930,539 unique tweets in English that discussed vaccinations posted between 1 February and 23 June 2020. We then identified links to 2,097 unique YouTube videos that were tweeted. Analysis of the video transcripts using Latent Dirichlet Allocation topic modeling and independent coders indicate the dominance of conspiracy theories. Following the World Health Organization’s declaration of the COVID-19 outbreak as a public health emergency of international concern, anti-vaccination frames rapidly transitioned from claiming that vaccines cause autism to pandemic conspiracy theories, often featuring Bill Gates. Content analysis of the 20 most tweeted videos revealed that the majority (n = 15) opposed vaccination and included conspiracy theories. Their spread on Twitter was consistent with spamming and coordinated efforts. These findings show the role of cross-platform sharing of YouTube videos over Twitter as a strategy to propagate primarily anti-vaccination messages. Future policies and interventions should consider how to counteract misinformation spread via such cross-platform activities.", "year": 2022, "ssId": "aa30949af5b59624224980e7d741ad8c084271ec", "arXivId": null, "link": null, "openAccess": false, "authors": ["T. Ginossar", "Iain J. Cruickshank", "E. Zheleva", "J. Sulskis", "Tanya Berger-Wolf"]}