{"title": "Causal Inference in Natural Language Processing: Estimation, Prediction, Interpretation and Beyond", "abstract": "A fundamental goal of scientific research is to learn about causal relationships. However, despite its critical role in the life and social sciences, causality has not had the same importance in Natural Language Processing (NLP), which has traditionally placed more emphasis on predictive tasks. This distinction is beginning to fade, with an emerging area of interdisciplinary research at the convergence of causal inference and language processing. Still, research on causality in NLP remains scattered across domains without unified definitions, benchmark datasets and clear articulations of the remaining challenges. In this survey, we consolidate research across academic areas and situate it in the broader NLP landscape. We introduce the statistical challenge of estimating causal effects, encompassing settings where text is used as an outcome, treatment, or as a means to address confounding. In addition, we explore potential uses of causal inference to improve the performance, robustness, fairness, and interpretability of NLP models. We thus provide a unified overview of causal inference for the computational linguistics community. 1 ∗All authors equally contributed to this paper. Author names are organized alphabetically in two clusters: First students and post-docs and then faculty members. The email address of the corresponding (first) author is: feder@campus.technion.ac.il. An online repository containing existing research on causal inference and language processing is available here: https://github.com/causaltext/", "year": 2021, "ssId": "af4e11436268cf68505f1caee5d6f7ff0df9c99a", "arXivId": "2109.00725", "link": "https://arxiv.org/pdf/2109.00725.pdf", "openAccess": true, "authors": ["Amir Feder", "Katherine A. Keith", "Emaad A. Manzoor", "Reid Pryzant", "Dhanya Sridhar", "Zach Wood-Doughty", "Jacob Eisenstein", "Justin Grimmer", "Roi Reichart", "Margaret E. Roberts", "Brandon M Stewart", "Victor Veitch", "Diyi Yang"]}