{"title": "Two-Tier Cellular Networks for Throughput Maximization of Static and Mobile Users", "abstract": "In small cell networks, the high mobility of users results in frequent handoff and thus severely restricts the data rate for mobile users (MUs). To alleviate this problem, we propose use of the heterogeneous two-tier network structure where static users (SUs) are served by both macro and micro base stations (BSs), whereas the mobile (i.e., moving) users are served only by the macro BSs having larger cells; the idea is to prevent frequent data outage for MUs due to handoff. We use the classical two-tier Poisson network model with different transmit powers, and assume the independent Poisson process of SUs and doubly stochastic Poisson process of MUs moving at a constant speed along infinite straight lines generated by a Poisson line process. Using tools from stochastic geometry, we calculate the average downlink data rate of the typical static and mobile (i.e., moving) users, and the latter accounted for handoff outage periods. We consider also the average throughput of these two types of users defined as their average data rates divided by the mean total number of users co-served by the same base station. We find that if the density of a homogeneous network and/or the speed of MUs is high, it is advantageous to let the MUs connect only to some optimal fraction of BSs (i.e., an optimal random subset of BSs) to reduce the frequency of handoffs during which the connection is not assured. If a heterogeneous structure of the network is allowed, one can further jointly optimize the mean throughput of MUs and SUs. This joint optimization is done by appropriately tuning the powers of micro and macro BSs subject to some aggregate power constraint ensuring unchanged mean data rates of SUs via the network equivalence property.", "year": 2019, "ssId": "aff5d7f43823e06bb68220db41de3bc82e2f3990", "arXivId": null, "link": null, "openAccess": false, "authors": ["Arpan Chattopadhyay", "B. Błaszczyszyn", "E. Altman"]}