{"title": "Contribution of anti-β2glycoprotein I IgA antibodies to the diagnosis of anti-phospholipid syndrome: potential interest of target domains to discriminate thrombotic and non-thrombotic patients.", "abstract": "OBJECTIVES\nAlthough the last international guidelines for aPL recommended determination of IgA aCL and anti-β2glycoprotein I (aβ2GPI) antibodies for the evaluation of APS in the absence of conventional IgG or IgM aCL and aβ2GPI antibodies, the clinical value of these antibodies remains controversial. We evaluated the clinical utility of IgA aPL and of the determination of target domains of aβ2GPI IgA antibodies.\n\n\nMETHODS\nA retrospective analysis was performed on sera from 439 patients referred for routine detection of aPL IgA by in-house ELISA. Sera positive for aβ2GPI IgA were subsequently tested for aβ2GPI domain 1 (D1) and domain 4/5 (D4/5) antibodies using ELISAs.\n\n\nRESULTS\nThe prevalence of aβ2GPI IgA antibodies was 16% in patients, significantly different from controls (1%, P < 0.0001). These antibodies were associated with clinical contexts related to APS as thrombosis (28.6% vs. 15%, P = 0.009) and SLE (42% vs. 15%, P < 0.0001). Interestingly, determination of their target domains revealed a significant association between aβ2GPI IgA directed against D4/5 and SLE without thrombosis (66.7 vs. 16.7%, P = 0.002). In contrast, aCL IgA were not more prevalent in patients than in controls.\n\n\nCONCLUSION\nOur study confirmed the interest of aβ2GP1 IgA in the exploration of APS and suggests that identification of target domains of aβ2GP1 IgA may be useful in the evaluation of thrombotic risk in SLE patients.", "year": 2014, "ssId": "b168fc72fa39e9669567bd099bab179549a15e14", "arXivId": null, "link": null, "openAccess": false, "authors": ["L. Despierres", "A. Beziane", "G. Kaplanski", "B. Granel", "J. Serratrice", "William W. Cohen", "F. Bretelle", "P. Rossi", "P. Morange", "P. Weiller", "Jean Robert Harlé", "P. Bongrand", "N. Bardin"]}