{"title": "Bootstrapping an interactive information extraction system for FlyBase curation", "abstract": "We describe an adaptive information extraction (IE) system designed to \naid the curation of papers about fruit fly genomics for incorporation \ninto FlyBase. FlyBase employs a team of about eight curators who fill \nin prespecified IE templetes (called proformas) for each gene and \nallele discussed in a given paper with curatable information \nassociated with it. The normal approach to curation is to load the PDF \nof the paper into a tool such as Acroread and to use the `Find' \nfunction to search for repeated mentions of an entity of interest. The \nrelevant information is then typed into the appropriate template \nfields. Templates are then checked for consistency and automatically \nintegrated into the database. \n \nWe have developed PaperBrowser, a tool designed to make it easier for \ncurators to locate relevant information. The tool takes the PDF \nversion of the paper as input and rerenders it as SciXML, a standard \ndeveloped at Cambridge for representing the logical structure of \nscientific articles in a fashion amenable to text mining. The basic \nSciXML is augmented by a gene name recogniser and anaphora \nresolution module so that PaperBrowser is able to highlight gene names \nin the paper and to provide a navigation bar which allows the curator \nto jump to specific mentions of a given gene in the various sections \nof the paper. Alternatively, the curator can select a specific gene \nmention and the browser will highlight all the noun phrases which are \nanaphorically linked to that gene mention. These anaphoric links can \neither be coreferential, or associative to the gene's products or \ncomponents, such as proteins or RNA. \n \nUser-based evaluation of PaperBrowser in comparison to the use of \nAcroread, with FlyBase curators undertaking the task of finding the \nset of genes and alleles for which templates should be constructed, \nhas demonstrated that curation is 20\\% faster at no cost to accuracy \nwhen using PaperBrowser. PaperBrowser uses a conditional random field \nmodel to perform gene name recognition bootstrapped from training data \nderived automatically via information in FlyBase. The anaphora \nresolution algorithm is unsupervised but uses information from the \nSequence Ontology augmented with lexemes from UMLS to identify noun \nphrases referring to gene products and components. The PDF extraction \ntool uses a commercial OCR package augmented with a seed-based machine \nlearning technique to learn the mapping from font and format \ninformation to the logical structure of the paper. Papers describing \nthe complete processing pipeline, intrinsic evaluation of the \nindividual components and user-based experiments, along with test \ndatasets are available from the FlySlip Project website", "year": 2008, "ssId": "b54efe01969adaa1c623331d5791897a4dd9f886", "arXivId": null, "link": null, "openAccess": false, "authors": ["Ted Briscoe", "C. Gasperin", "Ian Lewin", "Andreas Vlachos"]}