{"title": "Vaccine-Related Content, Dynamics, and Conspiracy Theories in External Links Shared in Twitter COVID-19 Conversations: A Computational Analysis (Preprint)", "abstract": "\n BACKGROUND\n The onset of the COVID-19 pandemic and the consequent “infodemic” that ensued highlighted the role that social media play in increasing vaccine hesitancy. Despite the efforts to curtail the spread of misinformation, the anti-vaccination movement continues to use Twitter and other social media platforms to advance its messages. Although users typically engage with different social media platforms, research on vaccination discourse typically focused on single platforms. Understanding the content and dynamics of external content shared on vaccine-related conversations on Twitter during the COVID-19 pandemic can shed light on the use of different sources, including traditional media and social media by the anti-vaccination movement. In particular, examining how YouTube videos are shared within vaccination-related tweets is important in understanding the spread of anti-vaccination narratives.\n \n \n OBJECTIVE\n informed by agenda-setting theory, this study aimed to use machine-learning to understand the content and dynamics of external websites shared in vaccines-related tweets posted in COVID-19 conversations on Twitter.\n \n \n METHODS\n We screened around 5 million tweets posted to COVID-19 related conversations to include tweets that discussed vaccination. We then identified external content, including the most tweeted web domains and URLs within these tweets and the number of days they were shared. The topics and dynamics of tweeted YouTube videos were further analyzed by using Latent Dirichlet Allocation to topic-model the transcripts of the YouTube videos, and by independent coders.\n \n \n RESULTS\n of 841,896 vaccination-related tweets identified, 128,408 (22.1%) included external content. A wide range of external websites were shared. The 20 most tweeted websites constituted 10.9% of the shared websites and were typically shared for only 2-3 days within a one-month period. Traditional media constituted the majority of these 20 most tweeted URLs. Content of YouTube links shared had both the greatest number of unique URLs for any given URL domain and was the most tweeted domain over time. The majority (n=15) of the 20 most tweeted videos opposed vaccinations and featured conspiracy theories. Analysis of the transcripts of 1,280 YouTube videos shared indicated high frequency of conspiracy theories.\n \n \n CONCLUSIONS\n Our study reveals that sharing URLs over Twitter is a common communication strategy. Whereas shared URLs overall demonstrated a strong presence of legacy media organizations, YouTube videos were used to spread anti-vaccination messages. Produced by individuals or by foreign governments, these videos emerged as a major driver for sharing vaccine-related conspiracy theories. Future interventions should take into account cross-platform use to counteract this misinformation.\n", "year": null, "ssId": "b990331a5394f3642a1fd1791d70bfa2d85d9d1d", "arXivId": null, "link": null, "openAccess": false, "authors": ["Iain J. Cruickshank", "T. Ginossar", "J. Sulskis", "E. Zheleva", "T. Berger-Wolf"]}