{"title": "A Web-based information system that reasons with structured collections of text", "abstract": "The degree to which information sources are pre-processed by Web-based information systems varies greatly. In search engines like Altavista, little pre-processing is done, while in \\knowledge integration\" systems, complex site-speciic \\wrappers\" are used integrate diierent information sources into a common database representation. In this paper we describe an intermediate between these two models. In our system, information sources are converted into a highly structured collection of small fragments of text. Database-like queries to this structured collection of text fragments are approximated using a novel logic called WHIRL, which combines inference in the style of deductive databases with ranked retrieval methods from information retrieval. WHIRL allows queries that integrate information from multiple Web sites, without requiring the extraction and nor-malization of object identiiers that can be used as keys; instead, operations that in conventional databases require equality tests on keys are approximated using IR similarity metrics for text. This leads to a reduction in the amount of human engineering required to eld a knowledge integration system. Experimental evidence is given showing that many information sources can be easily modeled with WHIRL, and that inferences in the logic are both accurate and eecient. 1 Introduction There are (at least) two diierent models for systems designed to access information on the Web. The rst model, which might be called the information retrieval (IR) model, is exempliied by search engines like Lycos and Altavista. In this model a large portion of the Web can be queried, but the query language is limited to keyword searches on single documents. The second model is exempliied by systems like the Information Manifold 14], TSIMMIS 9], and others 2, 4]. This \\knowledge integration model\" supports more complex database-like queries; in particular queries that integrate information from multiple Web sites can be formulated. However, current knowledge integration systems require extraction of database-like information from", "year": 1998, "ssId": "c2dd1c332f65fea3a66f4a982428f31ce1a9dc70", "arXivId": null, "link": null, "openAccess": false, "authors": ["William W. Cohen"]}