{"title": "Partial Counterfactual Identification from Observational and Experimental Data", "abstract": "This paper investigates the problem of bounding counterfactual queries from an arbitrary collection of observational and experimental distributions and qualitative knowledge about the underlying data-generating model represented in the form of a causal diagram. We show that all counterfactual distributions in an arbitrary structural causal model (SCM) could be generated by a canonical family of SCMs with the same causal diagram where unobserved (exogenous) variables are discrete with a finite domain. Utilizing the canonical SCMs, we translate the problem of bounding counterfactuals into that of polynomial programming whose solution provides optimal bounds for the counterfactual query. Solving such polynomial programs is in general computationally expensive. We therefore develop effective Monte Carlo algorithms to approximate the optimal bounds from an arbitrary combination of observational and experimental data. Our algorithms are validated extensively on synthetic and real-world datasets. Introduction This paper studies the problem of inferring counterfactual queries from a combination of observations, experiments, and qualitative assumptions about the phenomenon under investigation. The assumptions are represented in the form of a causal diagram (Pearl 1995), which is a directed acyclic graph where arrows indicate the potential existence of functional relationships among corresponding variables; some variables are unobserved. This problem arises in diverse fields such as artificial intelligence, statistics, cognitive science, economics, and the health and social sciences. For example, when investigating the gender discrimination in college admission, one may ask “what would the admission outcome be for a female applicant had she been a male?” Such a counterfactual query contains conflicting information: in the real world the applicant is female, in the hypothetical world she was not. Therefore, it is not immediately clear how to design effective experimental procedures for evaluating counterfactuals, or how to compute them from observational data. The problem of identifying counterfactual distributions from the combination of data and a causal diagram has been studied in the causal inference literature. First, there exists a complete proof system for reasoning about counterfactual queries (Halpern 1998). While such a system, in prinPreprint. Under review. ciple, is sufficient in evaluating any identifiable counterfactual expression, it lacks a proof guideline that determines the feasibility of such evaluation efficiently. There are algorithms to determine whether a counterfactual distribution is inferrable from all possible controlled experiments (Shpitser and Pearl 2007), or a special type of counterfactual distributions, called path-specific effects, from observational (Shpitser and Sherman 2018) and experimental data (Avin, Shpitser, and Pearl 2005). Finally, there exist an algorithm that decides whether any nested counterfactual is identifiable an arbitrary combination of observational and experimental distributions (Correa, Lee, and Bareinboim 2021). In practice, however, the combination of quantitative knowledge and observed data does not always permit one to uniquely determine the target counterfactual query. In such cases, the counterfactual query is said to be non-identifiable. Partial identification methods concern with deriving informative bounds over the target counterfactual probability in non-identifiable settings. Several algorithms have been developed to bound counterfactual probabilities from the combination of observational and experimental data (Manski 1990; Robins 1989; Balke and Pearl 1994, 1997; Evans 2012; Richardson et al. 2014; Kallus and Zhou 2018, 2020; Finkelstein and Shpitser 2020; Kilbertus, Kusner, and Silva 2020; Zhang and Bareinboim 2021). In this work, we build on the approach introduced by Balke & Pearl in (Balke and Pearl 1994), which involves direct discretization of unobserved domains, also referred to as the canonical partitioning or the principal stratification (Frangakis and Rubin 2002; Pearl 2011). Consider the causal diagram in Fig. 1a, where X,Y, Z are binary variables in {0, 1}; U is an unobserved variable taking values in an arbitrary continuous domain. (Balke and Pearl 1994) showed that domains of U could be discretized into 16 equivalent classes without changing the original counterfactual distributions and the graphical structure in Fig. 1a. For instance, suppose that values of U are drawn from an arbitrary distribution P ∗(u) over a continuous domain. It has been shown that the observational distribution P (x, y, z) could be reproduced by a generative model of the form P (x, y, z) = ∑ u P (x|u, z)P (y|x, u)P (u)P (z), where P (u) is a discrete distribution over a finite domain {1, . . . , 16}. Using the finite-state representation of unobserved variables, (Balke and Pearl 1997) derived tight bounds on treatar X iv :2 11 0. 05 69 0v 1 [ cs .A I] 1 2 O ct 2 02 1 ment effects under a set of constraints called instrumental variables (e.g., Fig. 1a). (Chickering and Pearl 1997; Imbens and Rubin 1997) applied the parsimony of finite-state representation in a Bayesian framework, to obtain credible intervals for the posterior distribution of causal effects in noncompliance settings. Despite the optimality guarantees in their treatments, these bounds were only derived for specific settings. A systematic strategy for partial identification in an arbitrary causal diagram is still missing. There are significant challenges in bounding any counterfactual query in an arbitrary causal diagram given an arbitrary collection of observational and experimental data. Our goal in this paper is to overcome these challenges. We show that when inferring about counterfactual distributions (over finite observed variables) in an arbitrary causal diagram, one could restrict domains of unobserved variables to a finite space without loss of generality. This result allows us to develop novel partial identification algorithms to bound unknown counterfactual probabilities from an arbitrary combination of observational and experimental data. In some way, this paper can be seen as closing a long-standing open problem introduced by (Balke and Pearl 1994), where they solve a special bounding instance in the case of instrumental variables. More specifically, our contributions are as follows. (1) We introduce a special family of discrete structural causal models, and show that it could represent all categorical counterfactual distributions (with finite support) in an arbitrary causal diagram. (2) Using this result, we translate the partial identification task into an equivalent polynomial program. Solving such a program leads to bounds over target counterfactual probabilities that are provably optimal. (3) We develop an effective Monte Carlo algorithm to approximate optimal bounds from a finite number of observational and experimental data. Finally, our algorithms are validated extensively on synthetic and real-world datasets. Preliminaries We introduce in this section some basic notations and definitions that will be used throughout the paper. We use capital letters to denote variables (X), small letters for their values (x) and ΩX for their domains. For an arbitrary setX , let |X| be its cardinality. The probability distribution over variables X is denoted by P (X). For convenience, we consistently use P (x) as a shorthand for the probability P (X = x). Finally, the indicator function 1X=x returns 1 if an event X = x holds; otherwise, 1X=x is equal to 0. The basic semantical framework of our analysis rests on structural causal models (SCMs) (Pearl 2000, Ch. 7). An SCM M is a tuple 〈V ,U ,F , P 〉 where V is a set of endogenous variables and U is a set of exogenous variables. F is a set of functions where each fV ∈ F decides values of an endogenous variable V ∈ V taking as argument a combination of other variables in the system. That is, v ← fV (paV , uV ),PAV ⊆ V , UV ⊆ U . Exogenous variables U ∈ U are mutually independent, values of which are drawn from the exogenous distribution P (U). Naturally, M induces a joint distribution P (V ) over endogenous variables V , called the observational distribution. Each SCM M is also associated with a causal diagram Z X Y U1 U2", "year": 2021, "ssId": "c330ec2047d019d98233abb59d13b3256c662cc7", "arXivId": "2110.05690", "link": "https://arxiv.org/pdf/2110.05690.pdf", "openAccess": true, "authors": ["Junzhe Zhang", "Jin Tian", "E. Bareinboim"]}