{"title": "Voice Timbre Control Based on Perceived Age in Singing Voice Conversion", "abstract": "The perceived age of a singing voice is the age of the singer as perceived by the listener, and is one of the notable characteristics that determines perceptions of a song. In this paper, we describe an investigation of acoustic features that have an effect on the perceived age, and a novel voice timbre control technique based on the perceived age for singing voice conversion (SVC). Singers can sing expressively by controlling prosody and voice timbre, but the varieties of voices that singers can produce are limited by physical constraints. Previous work has attempted to overcome this limitation through the use of statistical voice conversion. This technique makes it possible to convert singing voice timbre of an arbitrary source singer into those of an arbitrary target singer. However, it is still difficult to intuitively control singing voice characteristics by manipulating parameters corresponding to specific physical traits, such as gender and age. In this paper, we first perform an investigation of the factors that play a part in the listener’s perception of the singer’s age at first. Then, we applied a multiple-regression Gaussian mixture models (MR-GMM) to SVC for the purpose of controlling voice timbre based on the perceived age and we propose SVC based on the modified MR-GMM for manipulating the perceived age while maintaining singer’s individuality. The experimental results show that 1) the perceived age of singing voices corresponds relatively well to the actual age of the singer, 2) prosodic features have a larger effect on the perceived age than spectral features, 3) the individuality of a singer is influenced more heavily by segmental features than prosodic features 4) the proposed voice timbre control method makes it possible to change the singer’s perceived age while not having an adverse effect on the perceived individuality. key words: singing voice, voice conversion, perceived age, spectral and prosodic features, subjective evaluations", "year": 2014, "ssId": "c55d5805a6eb8b1482f21581fe893484eaf9ffb5", "arXivId": null, "link": null, "openAccess": false, "authors": ["Kazuhiro Kobayashi", "T. Toda", "Hironori Doi", "Tomoyasu Nakano", "Masataka Goto", "Graham Neubig", "S. Sakti", "Satoshi Nakamura"]}