{"title": "Content and Dynamics of Websites Shared Over Vaccine-Related Tweets in COVID-19 Conversations: Computational Analysis", "abstract": "Background The onset of the COVID-19 pandemic and the consequent “infodemic” increased concerns about Twitter’s role in advancing antivaccination messages, even before a vaccine became available to the public. New computational methods allow for analysis of cross-platform use by tracking links to websites shared over Twitter, which, in turn, can uncover some of the content and dynamics of information sources and agenda-setting processes. Such understanding can advance theory and efforts to reduce misinformation. Objective Informed by agenda-setting theory, this study aimed to identify the content and temporal patterns of websites shared in vaccine-related tweets posted to COVID-19 conversations on Twitter between February and June 2020. Methods We used triangulation of data analysis methods. Data mining consisted of the screening of around 5 million tweets posted to COVID-19 conversations to identify tweets that related to vaccination and including links to websites shared within these tweets. We further analyzed the content the 20 most-shared external websites using a mixed methods approach. Results Of 841,896 vaccination-related tweets identified, 185,994 (22.1%) contained links to specific websites. A wide range of websites were shared, with the 20 most-tweeted websites constituting 14.5% (27,060/185,994) of the shared websites and typically being shared for only 2 to 3 days. Traditional media constituted the majority of these 20 websites, along with other social media and governmental sources. We identified markers of inauthentic propagation for some of these links. Conclusions The topic of vaccination was prevalent in tweets about COVID-19 early in the pandemic. Sharing websites was a common communication strategy, and its “bursty” pattern and inauthentic propagation strategies pose challenges for health promotion efforts. Future studies should consider cross-platform use in dissemination of health information and in counteracting misinformation.", "year": 2021, "ssId": "c69da8266e2f3f67febf22b8f2bf91623346d283", "arXivId": null, "link": null, "openAccess": false, "authors": ["Iain J. Cruickshank", "T. Ginossar", "J. Sulskis", "E. Zheleva", "T. Berger-Wolf"]}