{"title": "Validating a Wheelchair In-Seat Activity Tracker.", "abstract": "BACKGROUND\nWheelchair users often experience prolonged periods of stationary sitting. Such periods are accompanied with increased loading of the ischial tuberosities. This can lead to the development of pressure ulcers which can cause complications such as sepsis. Periodic pressure offloading is recommended to reduce the onset of pressure ulcers. Experts recommend the periodic execution of different movements to provide the needed pressure offloading. Wheelchair users, however, might not remember to perform these recommended movements in terms of both quality and quantity. A system that can detect such movements could provide valuable feedback to both wheelchair users as well as clinicians.\n\n\nPURPOSE\nThe objective of this study was to present and validate the WiSAT - a system for characterizing in-seat activity for wheelchair users. WiSAT is designed to detect two kinds of movements - weight shifts and in-seat movements. Weight shifts are movements that offload pressure on ischial tuberosities by 30% as compared to upright sitting and are maintained for 15 seconds. In-seat movements are shorter transient movements that involve either a change in the center of pressure on the sitting buttocks or a transient reduction in total load by 30%. This study validates the use of WiSAT in manual wheelchairs.\n\n\nMETHODS\nWiSAT has a sensor mat which was inserted beneath a wheelchair cushion. Readings from these sensors were used by WiSAT algorithms to predict weight shifts and in-seat movements. These weight shifts and in-seat movements were validated against a high-resolution interface pressure mat in a dataset that resembles real world usage.\n\n\nRESULTS\nThe proposed system achieved weight shift precision and recall scores of 81% and 80% respectively while in-seat movement scores were predicted with a mean absolute error of 22%.\n\n\nCONCLUSION\nResults showed that WiSAT provides sufficient accuracy in characterizing in-seat activity in terms of weight shifts and in-seat movement.", "year": 2021, "ssId": "d4d25eaa373087ac80810d79afff863ef1bae3c3", "arXivId": null, "link": null, "openAccess": false, "authors": ["Nauman Ahad", "S. Sonenblum", "M. Davenport", "S. Sprigle"]}