{"title": "Learning Deep Implicit Fourier Neural Operators (IFNOs) with Applications to Heterogeneous Material Modeling", "abstract": "Constitutive modeling based on continuum mechanics theory has been a classical approach for modeling the mechanical responses of materials. However, when constitutive laws are unknown or when defects and/or high degrees of heterogeneity are present, these classical models may become inaccurate. In this work, we propose to use data-driven modeling, which directly utilizes high-fidelity simulation and/or experimental measurements to predict a material’s response without using conventional constitutive models. Specifically, the material response is modeled by learning the implicit mappings between loading conditions and the resultant displacement and/or damage fields, with the neural network serving as a surrogate for a solution operator. To model the complex responses due to material heterogeneity and defects, we develop a novel deep neural operator architecture, which we coin as the Implicit Fourier Neural Operator (IFNO). In the IFNO, the increment between layers is modeled as an integral operator to capture the long-range dependencies in the feature space. As the network gets deeper, the limit of IFNO becomes a fixed point equation that yields an implicit neural operator and naturally mimics the displacement/damage fields solving procedure in material modeling problems. To obtain an efficient implementation, we parameterize the integral kernel of this integral operator directly in the Fourier space and interpret the network as discretized integral (nonlocal) differential equations, which consequently allow for the fast Fourier transformation (FFT) and accelerated learning techniques for deep networks. We demonstrate the performance of our proposed method for a number of examples, including hyperelastic, anisotropic and brittle materials. As an application, we further employ the proposed approach to learn the material models directly from digital image correlation (DIC) tracking measurements, and show that the learned solution operators substantially outperform the conventional constitutive models in predicting displacement fields.", "year": 2022, "ssId": "d8551a4b49aa547ad8884ba9f545480860fcadd1", "arXivId": "2203.08205", "link": "https://arxiv.org/pdf/2203.08205.pdf", "openAccess": true, "authors": ["Huaiqian You", "Quinn Zhang", "Colton J. Ross", "Chung‐Hao Lee", "Yue Yu"]}