{"title": "An Evaluation through Simulation of Electrolarynx Control based on Statistical F 0 Prediction for Multiple Speakers", "abstract": "An electrolarynx is a device that artificially generates excitation sounds to produce electrolaryngeal (EL) speech. Although proficient laryngectomees can produce intelligible EL speech by using this device, it sounds quite unnatural due to the mechanical excitation. To address this issue, we have proposed several EL speech enhancement methods using statistical voice conversion and showed that statistical prediction of excitation parameters, such as F0 patterns, was essential to significantly improve naturalness of EL speech. Based on this result, we have also proposed a direct control method of F0 patterns of excitation sounds generated from electrolarynx based on the statistical excitation prediction as an EL speech enhancement method applicable to face-to-face conversation. In our previous work, this direct control method was evaluated through its simulation using only a single laryngectomee’s EL speech and it was demonstrated that this method enables to improve naturalness of EL speech while preserving its listenability. However, because quality of EL speech highly depends on proficiency of each laryngectomee, it is necessary to apply this method to other laryngectomees and evaluate its effectiveness. In addition, we need to evaluate this method from more various perspectives, such as not only naturalness and listenability but also intelligibility. In this paper, we apply the direct control method to multiple speakers consisting of two real laryngectomees and one non-laryngectomee and evaluate its performance through simulations in terms of naturalness, listenability, and intelligibility. The experimental results demonstrate that the proposed method yields significant improvements in naturalness of EL speech for multiple laryngectomees while keeping its listenability and intelligibility high enough.", "year": 2014, "ssId": "da06caf4f340ebc81395f092f9dc3a3101827506", "arXivId": null, "link": null, "openAccess": false, "authors": ["Kou Tanaka", "T. Toda", "Graham Neubig", "S. Sakti", "Satoshi Nakamura"]}