{"title": "Bidirectional LSTM-HMM Hybrid System for Polyphonic Sound Event Detection", "abstract": "In this study, we propose a new method of polyphonic sound event detection based on a Bidirectional Long Short-Term Memory Hidden Markov Model hybrid system (BLSTM-HMM). We extend the hybrid model of neural network and HMM, which achieved stateof-the-art performance in the field of speech recognition, to the multi-label classification problem. This extension provides an explicit duration model for output labels, unlike the straightforward application of BLSTM-RNN. We compare the performance of our proposed method to conventional methods such as non-negative matrix factorization (NMF) and standard BLSTM-RNN, using the DCASE2016 task 2 dataset. Our proposed method outperformed conventional approaches in both monophonic and polyphonic tasks, and finally achieved an average F1 score of 67.1 % (error rate of 64.5 %) on the event-based evaluation, and an average F1-score of 76.0 % (error rate of 50.0 %) on the segment-based evaluation. Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE) This work may not be copied or reproduced in whole or in part for any commercial purpose. Permission to copy in whole or in part without payment of fee is granted for nonprofit educational and research purposes provided that all such whole or partial copies include the following: a notice that such copying is by permission of Mitsubishi Electric Research Laboratories, Inc.; an acknowledgment of the authors and individual contributions to the work; and all applicable portions of the copyright notice. Copying, reproduction, or republishing for any other purpose shall require a license with payment of fee to Mitsubishi Electric Research Laboratories, Inc. All rights reserved. Copyright c © Mitsubishi Electric Research Laboratories, Inc., 2016 201 Broadway, Cambridge, Massachusetts 02139 Detection and Classification of Acoustic Scenes and Events 2016 3 September 2016, Budapest, Hungary BIDIRECTIONAL LSTM-HMM HYBRID SYSTEM FOR POLYPHONIC SOUND EVENT DETECTION Tomoki Hayashi, Shinji Watanabe, Tomoki Toda, Takaaki Hori, Jonathan Le Roux, Kazuya Takeda Nagoya University, Furo-cho, Chikusa-ku, Nagoya, Aichi 464-8603, Japan Mitsubishi Electric Research Laboratories (MERL), 201 Broadway, Cambridge, MA 02139, USA hayashi.tomoki@g.sp.m.is.nagoya-u.ac.jp, {takeda,tomoki}@is.nagoya-u.ac.jp, {watanabe,thori,leroux}@merl.com", "year": 2016, "ssId": "e2854bf66ed86a5dc74183bae5fde18e65699833", "arXivId": null, "link": null, "openAccess": false, "authors": ["Tomoki Hayashi", "Shinji Watanabe", "T. Toda", "Takaaki Hori", "Jonathan Le Roux", "K. Takeda"]}