{"title": "Blind prediction of interfacial water positions in CAPRI", "abstract": "We report the first assessment of blind predictions of water positions at protein–protein interfaces, performed as part of the critical assessment of predicted interactions (CAPRI) community‐wide experiment. Groups submitting docking predictions for the complex of the DNase domain of colicin E2 and Im2 immunity protein (CAPRI Target 47), were invited to predict the positions of interfacial water molecules using the method of their choice. The predictions—20 groups submitted a total of 195 models—were assessed by measuring the recall fraction of water‐mediated protein contacts. Of the 176 high‐ or medium‐quality docking models—a very good docking performance per se—only 44% had a recall fraction above 0.3, and a mere 6% above 0.5. The actual water positions were in general predicted to an accuracy level no better than 1.5 Å, and even in good models about half of the contacts represented false positives. This notwithstanding, three hotspot interface water positions were quite well predicted, and so was one of the water positions that is believed to stabilize the loop that confers specificity in these complexes. Overall the best interface water predictions was achieved by groups that also produced high‐quality docking models, indicating that accurate modelling of the protein portion is a determinant factor. The use of established molecular mechanics force fields, coupled to sampling and optimization procedures also seemed to confer an advantage. Insights gained from this analysis should help improve the prediction of protein–water interactions and their role in stabilizing protein complexes. Proteins 2014; 82:620–632. © 2013 Wiley Periodicals, Inc.", "year": 2014, "ssId": "ea6547e877c1cc3d37229a6f488ac04e9a11de18", "arXivId": null, "link": null, "openAccess": false, "authors": ["M. Lensink", "I. Moal", "P. Bates", "P. Kastritis", "A. Melquiond", "E. Karaca", "C. Schmitz", "M. Dijk", "A. Bonvin", "M. Eisenstein", "B. Jiménez-García", "Solène Grosdidier", "Albert Solernou", "L. Perez-Cano", "C. Pallara", "J. Fernández-Recio", "Jianqing Xu", "Pravin Muthu", "Krishna Praneeth Kilambi", "J. J. Gray", "S. Grudinin", "Georgy Derevyanko", "Julie C. Mitchell", "J. Wieting", "Eiji Kanamori", "Y. Tsuchiya", "Yoichi Murakami", "Joy Sarmiento", "D. Standley", "M. Shirota", "K. Kinoshita", "Haruki Nakamura", "M. Chavent", "D. Ritchie", "Hahnbeom Park", "Junsu Ko", "Hasup Lee", "Chaok Seok", "Yang Shen", "D. Kozakov", "S. Vajda", "P. Kundrotas", "I. Vakser", "B. Pierce", "Howook Hwang", "T. Vreven", "Z. Weng", "Idit Buch", "E. Farkash", "H. Wolfson", "M. Zacharias", "Sanbo Qin", "Huan‐Xiang Zhou", "Shengua Huang", "X. Zou", "J. Wojdyla", "C. Kleanthous", "S. Wodak"]}