{"title": "Conservation based uncertainty propagation in dynamic systems", "abstract": "Conservation Based Uncertainty Propagation in Dynamic Systems by Lillian J Ratliff Dr. Pushkin Kachroo, Examination Committee Chair Professor of Electrical and Computer Engineering University of Nevada, Las Vegas Uncertainty is present in our everyday decision making process as well as our understanding of the structure of the universe. As a result an intense and mathematically rigorous study of how uncertainty propagates in the dynamic systems present in our lives is warranted and arguably necessary. In this thesis we examine existing methods for uncertainty propagation in dynamic systems and present the results of a literature survey that justifies the development of a conservation based method of uncertainty propagation. Conservation methods are physics based and physics drives our understanding of the physical world. Thus, it makes perfect sense to formulate an understanding of uncertainty propagation in terms of one of the fundamental concepts in physics: conservation. We develop that theory for a small group of dynamic systems which are fundamental. They include ordinary differential equations, finite difference equations, differential inclusions and inequalities, stochastic differential equations, and Markov chains. The study presented considers uncertainty propagation from the initial condition where the initial condition is given as a prior distribution defined within a probability structure. This probability structure is preserved in the sense of measure. The results of this study are the first steps into a generalized theory for uncertainty propagation using conservation laws. In addition, it is hoped that the iii results can be used in applications such as robust control design for everything from transportation systems to financial markets.", "year": 2010, "ssId": "f16cf130ae75d1ea1ad3b926f605adef41af4af1", "arXivId": null, "link": null, "openAccess": false, "authors": ["L. Ratliff"]}