{"title": "Children’s Object Structure Perspective-Taking: Training and Assessment", "abstract": "Spatial abilities—required in both academic and everyday information processing—are recommended as an important target for explicit instruction in the K-12 curriculum. However, most school curricula do not address this spatial issue, probably because spatial ability is a general rather than domain-specific skill and also due to debate regarding individuals’ ability to transfer general skills to novel tasks. In particular, little is known about elementary school children’s object structure perspective-taking (OSPT) ability. We developed an age-appropriate OSPT assessment tool and examined differences in OSPT ability between 1st and 4th graders who did or did not receive OSPT training; children’s OSPT ability in relation to 3 object types: detailed everyday objects, contour only, and abstract geometrical target objects; the ability to identify a view seen by an observer and the ability to determine the vantage point from which a given view is seen; and problem-solving involving far transfer and difficult items. Problem-solving strategies and relations between these young children’s OSPT performance and their mathematic achievements were examined to further investigate the possible contribution of spatial ability to STEM learning. Our findings are promising in that a relatively short training effected significantly children’s OSPT ability—a general intellectual skill—calling for the development and introduction of OSPT-relevant K-12 curriculum, possibly using our training program as a model. Such curriculum is relevant in particular for girls, of whom OSPT showed significant correlation with mathematic scores for contoured and geometric objects. Fourth graders performed better than 1st graders, but the latter improved more.", "year": 2018, "ssId": "f6be5d90199d1644b85e6b41a7a7f42fb29dbc9a", "arXivId": null, "link": null, "openAccess": false, "authors": ["Billie Eilam", "Uri Alon"]}