{"title": "Design and Implementation of College Student Information Management System Based on Web", "abstract": "With the deepening of China’s higher education reform, the informatization of college student (CS) management is no longer a new thing. At present, in the face of the increasing complexity of higher vocational college management, the traditional way of data statistics and text recording can not meet the needs of the current situation, the introduction of information technology, automation, intelligent scientific management means and methods is the general trend. The student information management not only lays a solid foundation for improving the teaching work, but also provides a good foundation for the future development of students in information security and other aspects. This paper mainly studies the design and implementation of CS information management system (IMS) based on Web. In this paper, the information system structure framework is designed, using the B/S three-tier architecture, the design of user interface layer, business logic layer and data access layer. Then it analyzes the function of the information system, including the corresponding functional requirements of the system administrator, student management personnel and students. This paper also designed the function module, clearly constructed the hierarchical structure of the system and the business function module. In this paper, the cluster analysis method is used to evaluate the students’ performance comprehensively, which provides a reliable basis for the evaluation of students and gives a scientific comprehensive ranking of students. This paper puts the designed IMS into operation test, analyzes the proportion of its module use and explores its loopholes and defects, and shows them intuitively through charts. The experimental results show that in the operation of information management module, the highest proportion is the basic information module, accounting for 23.85%, followed by user management module, accounting for 19.72%, student curriculum module, accounting for 18.79%, student achievement module, accounting for 18.46%, physical health module, accounting for 5.33%, scholarship management module, accounting for 3.47%, tuition module, accounting for 10.38%.", "year": 2021, "ssId": "f91c24b0dc56a6b377e99e046d7540e5bb7aa46e", "arXivId": null, "link": null, "openAccess": false, "authors": ["Yue Yu"]}