{"title": "Endorsed By: Acl Siglex Acl Sigsem a Regression Model of Adjective-noun Compositionality in Distributional Semantics Semantic Composition with Quotient Algebras Expectation Vectors: a Semiotics Inspired Approach to Geometric Lexical-semantic Representation Sketch Techniques for Scaling Distributiona", "abstract": "Distributional models and semantic spaces represent a core topic in contemporary computational linguistics for their impact on advanced tasks and on other knowledge fields (such as social science and the humanities). Semantic spaces based on simple contextual units have been early used in information retrieval, showing dramatic impact on accuracy and scalability of many tasks. Later on, more linguistically principled spaces have been introduced for large-scale natural language learning problems, such as the acquisition of lexical taxonomies, word sense discrimination, pattern acquisition and conceptual clustering. More recently, specialized distributional models have been successfully applied to solve complex NLP tasks such as question answering, textual entailment and sentiment analysis. Cutting-edge applications include the adoption of semantic spaces as models of rich lexical semantic resources (e.g. lexical networks and lexicalized meaning theories, as frame semantics), and of machine learning approaches based on kernel methods. The GEMS 2010 Workshops builds on the successful first edition held in Athens in 2009 jointly with the Conference of the European Chapter of the Association for Computational Linguistics, which counted more than 40 registered people and a large audience. As a follow-up of the GEMS 2009 Workshop, the Special Issue of the Journal of Natural Engineering dedicated to \" Distributional Lexical Semantics \" 1 is a further proof of the high interest in this research area. The 2010 edition aims at consolidating GEMS' contribution to the field, by stimulating research on semantic spaces and distributional methods for NLP, by pushing for an interdisciplinary view, and by amplifying exchange of ideas, results and resources among often independent communities. The Workshop has successfully gathered high quality contributions to problems of meaning representation, acquisition and use, including a total of 15 paper submissions. After a peer-review phase, the program committee has selected 8 papers to be presented at the workshop, all of which have been included in these proceedings. The papers are representative of the current state of the art in distributional semantics, including: • cutting edge researches on geometric techniques and machine learning, such as tensor analysis, non-linear embeddings, kernel methods, and latent topic models; • applications of semantic space models to lexical acquisition tasks; • novel optimization techniques for efficient and scalable distributional methods. We would like to thank all the authors for the hard work dedicated to the submissions, and the members of the program committee for their precious reviewing. A special thanks goes to Katrin Erk …", "year": null, "ssId": "f9a86c2df17f408105c2d3e9429410cdc376c6f0", "arXivId": null, "link": null, "openAccess": false, "authors": ["R. Basili", "M. Pennacchiotti", "Enrique Alfonseca", "Marco Baroni", "P. Buitelaar", "Germany Dfki", "J. Bullinaria", "G. Grefenstette", "S. A. Exalead", "France", "Alpa Jain", "Jussi Karlgren", "Sebastian Padó", "Ted Pedersen", "A. Popescu", "Magnus Sahlgren", "Peter D Turney", "Katrin Erk", "Daoud Clarke", "R. Lutz", "David", "Amit Goyal", "Jagadeesh Jagaralamudi", "H. Iii", "David Jurgens", "K. Stevens", "David Weir", "Hal Daumé", "Suresh Venkatasubramanian", "Andreas Vlachos", "Zoubin Ghahramani", "Ted Briscoe"]}